
INSERT INTO groupworks.department (department_id, contact_number, department_name, location)
VALUES (1, '010-1234-5678', '기술부서', 'A동'),
       (2, '010-1234-5679', '마케팅부서', 'B동'),
       (3, '010-1234-5680', '영업부서', 'C동'),
       (4, '010-1234-5681', '인사부서', 'D동'),
       (5, '010-1234-5682', '재무부서', 'E동'),
       (6, '010-1234-5683', 'IT 지원부서', 'F동'),
       (7, '010-1234-5684', '제품 관리부서', 'G동'),
       (8, '010-1234-5685', '고객 서비스부서', 'H동'),
       (9, '010-1234-5686', '법무부서', 'I동'),
       (10, '010-1234-5687', '연구개발부서', 'J동');


INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',1,NULL,30000,0,'주소 1','employee1@gw.com','사원1','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1100','부장'),
	 (1,4,'2022-01-01 00:00:00',1,NULL,30010,1,'주소 2','employee2@gw.com','사원2','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1101','차장'),
	 (1,3,'2023-01-01 00:00:00',1,NULL,30020,2,'주소 3','employee3@gw.com','사원3','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1102','과장'),
	 (1,3,'2023-01-01 00:00:00',1,NULL,30030,2,'주소 4','employee4@gw.com','사원4','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1103','과장'),
	 (1,2,'2023-06-01 00:00:00',1,NULL,30040,4,'주소 5','employee5@gw.com','사원5','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1104','대리'),
	 (1,2,'2023-06-01 00:00:00',1,NULL,30050,4,'주소 6','employee6@gw.com','사원6','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1105','대리'),
	 (1,1,'2024-01-01 00:00:00',1,NULL,30060,6,'주소 7','employee7@gw.com','사원7','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1106','사원'),
	 (1,1,'2024-01-01 00:00:00',1,NULL,30070,6,'주소 8','employee8@gw.com','사원8','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1107','사원'),
	 (1,1,'2024-01-01 00:00:00',1,NULL,30080,6,'주소 9','employee9@gw.com','사원9','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1108','사원'),
	 (1,1,'2024-01-01 00:00:00',1,NULL,30090,6,'주소 10','employee10@gw.com','사원10','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1109','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',2,NULL,30100,0,'주소 11','employee11@gw.com','사원11','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1110','부장'),
	 (1,4,'2022-01-01 00:00:00',2,NULL,30110,11,'주소 12','employee12@gw.com','사원12','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1111','차장'),
	 (1,3,'2023-01-01 00:00:00',2,NULL,30120,12,'주소 13','employee13@gw.com','사원13','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1112','과장'),
	 (1,3,'2023-01-01 00:00:00',2,NULL,30130,12,'주소 14','employee14@gw.com','사원14','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1113','과장'),
	 (1,2,'2023-06-01 00:00:00',2,NULL,30140,14,'주소 15','employee15@gw.com','사원15','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1114','대리'),
	 (1,2,'2023-06-01 00:00:00',2,NULL,30150,14,'주소 16','employee16@gw.com','사원16','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1115','대리'),
	 (1,1,'2024-01-01 00:00:00',2,NULL,30160,16,'주소 17','employee17@gw.com','사원17','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1116','사원'),
	 (1,1,'2024-01-01 00:00:00',2,NULL,30170,16,'주소 18','employee18@gw.com','사원18','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1117','사원'),
	 (1,1,'2024-01-01 00:00:00',2,NULL,30180,16,'주소 19','employee19@gw.com','사원19','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1118','사원'),
	 (1,1,'2024-01-01 00:00:00',2,NULL,30190,16,'주소 20','employee20@gw.com','사원20','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1119','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',3,NULL,30200,0,'주소 21','employee21@gw.com','사원21','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1120','부장'),
	 (1,4,'2022-01-01 00:00:00',3,NULL,30210,21,'주소 22','employee22@gw.com','사원22','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1121','차장'),
	 (1,3,'2023-01-01 00:00:00',3,NULL,30220,22,'주소 23','employee23@gw.com','사원23','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1122','과장'),
	 (1,3,'2023-01-01 00:00:00',3,NULL,30230,22,'주소 24','employee24@gw.com','사원24','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1123','과장'),
	 (1,2,'2023-06-01 00:00:00',3,NULL,30240,24,'주소 25','employee25@gw.com','사원25','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1124','대리'),
	 (1,2,'2023-06-01 00:00:00',3,NULL,30250,24,'주소 26','employee26@gw.com','사원26','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1125','대리'),
	 (1,1,'2024-01-01 00:00:00',3,NULL,30260,26,'주소 27','employee27@gw.com','사원27','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1126','사원'),
	 (1,1,'2024-01-01 00:00:00',3,NULL,30270,26,'주소 28','employee28@gw.com','사원28','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1127','사원'),
	 (1,1,'2024-01-01 00:00:00',3,NULL,30280,26,'주소 29','employee29@gw.com','사원29','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1128','사원'),
	 (1,1,'2024-01-01 00:00:00',3,NULL,30290,26,'주소 30','employee30@gw.com','사원30','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1129','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',4,NULL,30300,0,'주소 31','employee31@gw.com','사원31','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1130','부장'),
	 (1,4,'2022-01-01 00:00:00',4,NULL,30310,31,'주소 32','employee32@gw.com','사원32','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1131','차장'),
	 (1,3,'2023-01-01 00:00:00',4,NULL,30320,32,'주소 33','employee33@gw.com','사원33','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1132','과장'),
	 (1,3,'2023-01-01 00:00:00',4,NULL,30330,32,'주소 34','employee34@gw.com','사원34','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1133','과장'),
	 (1,2,'2023-06-01 00:00:00',4,NULL,30340,34,'주소 35','employee35@gw.com','사원35','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1134','대리'),
	 (1,2,'2023-06-01 00:00:00',4,NULL,30350,34,'주소 36','employee36@gw.com','사원36','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1135','대리'),
	 (1,1,'2024-01-01 00:00:00',4,NULL,30360,36,'주소 37','employee37@gw.com','사원37','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1136','사원'),
	 (1,1,'2024-01-01 00:00:00',4,NULL,30370,36,'주소 38','employee38@gw.com','사원38','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1137','사원'),
	 (1,1,'2024-01-01 00:00:00',4,NULL,30380,36,'주소 39','employee39@gw.com','사원39','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1138','사원'),
	 (1,1,'2024-01-01 00:00:00',4,NULL,30390,36,'주소 40','employee40@gw.com','사원40','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1139','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',5,NULL,30400,0,'주소 41','employee41@gw.com','사원41','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1140','부장'),
	 (1,4,'2022-01-01 00:00:00',5,NULL,30410,41,'주소 42','employee42@gw.com','사원42','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1141','차장'),
	 (1,3,'2023-01-01 00:00:00',5,NULL,30420,42,'주소 43','employee43@gw.com','사원43','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1142','과장'),
	 (1,3,'2023-01-01 00:00:00',5,NULL,30430,42,'주소 44','employee44@gw.com','사원44','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1143','과장'),
	 (1,2,'2023-06-01 00:00:00',5,NULL,30440,44,'주소 45','employee45@gw.com','사원45','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1144','대리'),
	 (1,2,'2023-06-01 00:00:00',5,NULL,30450,44,'주소 46','employee46@gw.com','사원46','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1145','대리'),
	 (1,1,'2024-01-01 00:00:00',5,NULL,30460,46,'주소 47','employee47@gw.com','사원47','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1146','사원'),
	 (1,1,'2024-01-01 00:00:00',5,NULL,30470,46,'주소 48','employee48@gw.com','사원48','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1147','사원'),
	 (1,1,'2024-01-01 00:00:00',5,NULL,30480,46,'주소 49','employee49@gw.com','사원49','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1148','사원'),
	 (1,1,'2024-01-01 00:00:00',5,NULL,30490,46,'주소 50','employee50@gw.com','사원50','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1149','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',6,NULL,30500,0,'주소 51','employee51@gw.com','사원51','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1150','부장'),
	 (1,4,'2022-01-01 00:00:00',6,NULL,30510,51,'주소 52','employee52@gw.com','사원52','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1151','차장'),
	 (1,3,'2023-01-01 00:00:00',6,NULL,30520,52,'주소 53','employee53@gw.com','사원53','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1152','과장'),
	 (1,3,'2023-01-01 00:00:00',6,NULL,30530,52,'주소 54','employee54@gw.com','사원54','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1153','과장'),
	 (1,2,'2023-06-01 00:00:00',6,NULL,30540,54,'주소 55','employee55@gw.com','사원55','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1154','대리'),
	 (1,2,'2023-06-01 00:00:00',6,NULL,30550,54,'주소 56','employee56@gw.com','사원56','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1155','대리'),
	 (1,1,'2024-01-01 00:00:00',6,NULL,30560,56,'주소 57','employee57@gw.com','사원57','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1156','사원'),
	 (1,1,'2024-01-01 00:00:00',6,NULL,30570,56,'주소 58','employee58@gw.com','사원58','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1157','사원'),
	 (1,1,'2024-01-01 00:00:00',6,NULL,30580,56,'주소 59','employee59@gw.com','사원59','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1158','사원'),
	 (1,1,'2024-01-01 00:00:00',6,NULL,30590,56,'주소 60','employee60@gw.com','사원60','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1159','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',7,NULL,30600,0,'주소 61','employee61@gw.com','사원61','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1160','부장'),
	 (1,4,'2022-01-01 00:00:00',7,NULL,30610,61,'주소 62','employee62@gw.com','사원62','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1161','차장'),
	 (1,3,'2023-01-01 00:00:00',7,NULL,30620,62,'주소 63','employee63@gw.com','사원63','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1162','과장'),
	 (1,3,'2023-01-01 00:00:00',7,NULL,30630,62,'주소 64','employee64@gw.com','사원64','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1163','과장'),
	 (1,2,'2023-06-01 00:00:00',7,NULL,30640,64,'주소 65','employee65@gw.com','사원65','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1164','대리'),
	 (1,2,'2023-06-01 00:00:00',7,NULL,30650,64,'주소 66','employee66@gw.com','사원66','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1165','대리'),
	 (1,1,'2024-01-01 00:00:00',7,NULL,30660,66,'주소 67','employee67@gw.com','사원67','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1166','사원'),
	 (1,1,'2024-01-01 00:00:00',7,NULL,30670,66,'주소 68','employee68@gw.com','사원68','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1167','사원'),
	 (1,1,'2024-01-01 00:00:00',7,NULL,30680,66,'주소 69','employee69@gw.com','사원69','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1168','사원'),
	 (1,1,'2024-01-01 00:00:00',7,NULL,30690,66,'주소 70','employee70@gw.com','사원70','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1169','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',8,NULL,30700,0,'주소 71','employee71@gw.com','사원71','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1170','부장'),
	 (1,4,'2022-01-01 00:00:00',8,NULL,30710,71,'주소 72','employee72@gw.com','사원72','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1171','차장'),
	 (1,3,'2023-01-01 00:00:00',8,NULL,30720,72,'주소 73','employee73@gw.com','사원73','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1172','과장'),
	 (1,3,'2023-01-01 00:00:00',8,NULL,30730,72,'주소 74','employee74@gw.com','사원74','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1173','과장'),
	 (1,2,'2023-06-01 00:00:00',8,NULL,30740,74,'주소 75','employee75@gw.com','사원75','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1174','대리'),
	 (1,2,'2023-06-01 00:00:00',8,NULL,30750,74,'주소 76','employee76@gw.com','사원76','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1175','대리'),
	 (1,1,'2024-01-01 00:00:00',8,NULL,30760,76,'주소 77','employee77@gw.com','사원77','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1176','사원'),
	 (1,1,'2024-01-01 00:00:00',8,NULL,30770,76,'주소 78','employee78@gw.com','사원78','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1177','사원'),
	 (1,1,'2024-01-01 00:00:00',8,NULL,30780,76,'주소 79','employee79@gw.com','사원79','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1178','사원'),
	 (1,1,'2024-01-01 00:00:00',8,NULL,30790,76,'주소 80','employee80@gw.com','사원80','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1179','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',9,NULL,30800,0,'주소 81','employee81@gw.com','사원81','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1180','부장'),
	 (1,4,'2022-01-01 00:00:00',9,NULL,30810,81,'주소 82','employee82@gw.com','사원82','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1181','차장'),
	 (1,3,'2023-01-01 00:00:00',9,NULL,30820,82,'주소 83','employee83@gw.com','사원83','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1182','과장'),
	 (1,3,'2023-01-01 00:00:00',9,NULL,30830,82,'주소 84','employee84@gw.com','사원84','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1183','과장'),
	 (1,2,'2023-06-01 00:00:00',9,NULL,30840,84,'주소 85','employee85@gw.com','사원85','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1184','대리'),
	 (1,2,'2023-06-01 00:00:00',9,NULL,30850,84,'주소 86','employee86@gw.com','사원86','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1185','대리'),
	 (1,1,'2024-01-01 00:00:00',9,NULL,30860,86,'주소 87','employee87@gw.com','사원87','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1186','사원'),
	 (1,1,'2024-01-01 00:00:00',9,NULL,30870,86,'주소 88','employee88@gw.com','사원88','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1187','사원'),
	 (1,1,'2024-01-01 00:00:00',9,NULL,30880,86,'주소 89','employee89@gw.com','사원89','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1188','사원'),
	 (1,1,'2024-01-01 00:00:00',9,NULL,30890,86,'주소 90','employee90@gw.com','사원90','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1189','사원');
INSERT INTO groupworks.employee (is_active,rank_id,created_date,department_id,last_modified_date,salary,supervisor_id,address,email,employee_name,employee_pw,gender,phone_number,rank_name) VALUES
	 (1,5,'2021-01-01 00:00:00',10,NULL,30900,0,'주소 91','employee91@gw.com','사원91','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1190','부장'),
	 (1,4,'2022-01-01 00:00:00',10,NULL,30910,91,'주소 92','employee92@gw.com','사원92','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1191','차장'),
	 (1,3,'2023-01-01 00:00:00',10,NULL,30920,92,'주소 93','employee93@gw.com','사원93','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1192','과장'),
	 (1,3,'2023-01-01 00:00:00',10,NULL,30930,92,'주소 94','employee94@gw.com','사원94','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1193','과장'),
	 (1,2,'2023-06-01 00:00:00',10,NULL,30940,94,'주소 95','employee95@gw.com','사원95','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1194','대리'),
	 (1,2,'2023-06-01 00:00:00',10,NULL,30950,94,'주소 96','employee96@gw.com','사원96','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1195','대리'),
	 (1,1,'2024-01-01 00:00:00',10,NULL,30960,96,'주소 97','employee97@gw.com','사원97','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1196','사원'),
	 (1,1,'2024-01-01 00:00:00',10,NULL,30970,96,'주소 98','employee98@gw.com','사원98','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1197','사원'),
	 (1,1,'2024-01-01 00:00:00',10,NULL,30980,96,'주소 99','employee99@gw.com','사원99','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','여','010-1111-1198','사원'),
	 (1,1,'2024-01-01 00:00:00',10,NULL,30990,96,'주소 100','employee100@gw.com','사원100','$2a$10$Vg4CIc8WunwnKoV2.j9J.uPep8BgLAzb2VelL89I.hGiLBDNoybpO','남','010-1111-1199','사원');


INSERT INTO groupworks.vacation_history (annual_days_used, sick_days_used, other_days_used, total_annual, employee_id)
VALUES (0, 0, 0, 25, 1),
       (0, 0, 0, 25, 2),
       (0, 0, 0, 25, 3),
       (0, 0, 0, 25, 4),
       (0, 0, 0, 25, 5),
       (0, 0, 0, 25, 6),
       (0, 0, 0, 25, 7),
       (0, 0, 0, 25, 8),
       (0, 0, 0, 25, 9),
       (0, 0, 0, 25, 10),
       (0, 0, 0, 25, 11),
       (0, 0, 0, 25, 12),
       (0, 0, 0, 25, 13),
       (0, 0, 0, 25, 14),
       (0, 0, 0, 25, 15),
       (0, 0, 0, 25, 16),
       (0, 0, 0, 25, 17),
       (0, 0, 0, 25, 18),
       (0, 0, 0, 25, 19),
       (0, 0, 0, 25, 20),
       (0, 0, 0, 25, 21),
       (0, 0, 0, 25, 22),
       (0, 0, 0, 25, 23),
       (0, 0, 0, 25, 24),
       (0, 0, 0, 25, 25),
       (0, 0, 0, 25, 26),
       (0, 0, 0, 25, 27),
       (0, 0, 0, 25, 28),
       (0, 0, 0, 25, 29),
       (0, 0, 0, 25, 30),
       (0, 0, 0, 25, 31),
       (0, 0, 0, 25, 32),
       (0, 0, 0, 25, 33),
       (0, 0, 0, 25, 34),
       (0, 0, 0, 25, 35),
       (0, 0, 0, 25, 36),
       (0, 0, 0, 25, 37),
       (0, 0, 0, 25, 38),
       (0, 0, 0, 25, 39),
       (0, 0, 0, 25, 40),
       (0, 0, 0, 25, 41),
       (0, 0, 0, 25, 42),
       (0, 0, 0, 25, 43),
       (0, 0, 0, 25, 44),
       (0, 0, 0, 25, 45),
       (0, 0, 0, 25, 46),
       (0, 0, 0, 25, 47),
       (0, 0, 0, 25, 48),
       (0, 0, 0, 25, 49),
       (0, 0, 0, 25, 50),
       (0, 0, 0, 25, 51),
       (0, 0, 0, 25, 52),
       (0, 0, 0, 25, 53),
       (0, 0, 0, 25, 54),
       (0, 0, 0, 25, 55),
       (0, 0, 0, 25, 56),
       (0, 0, 0, 25, 57),
       (0, 0, 0, 25, 58),
       (0, 0, 0, 25, 59),
       (0, 0, 0, 25, 60),
       (0, 0, 0, 25, 61),
       (0, 0, 0, 25, 62),
       (0, 0, 0, 25, 63),
       (0, 0, 0, 25, 64),
       (0, 0, 0, 25, 65),
       (0, 0, 0, 25, 66),
       (0, 0, 0, 25, 67),
       (0, 0, 0, 25, 68),
       (0, 0, 0, 25, 69),
       (0, 0, 0, 25, 70),
       (0, 0, 0, 25, 71),
       (0, 0, 0, 25, 72),
       (0, 0, 0, 25, 73),
       (0, 0, 0, 25, 74),
       (0, 0, 0, 25, 75),
       (0, 0, 0, 25, 76),
       (0, 0, 0, 25, 77),
       (0, 0, 0, 25, 78),
       (0, 0, 0, 25, 79),
       (0, 0, 0, 25, 80),
       (0, 0, 0, 25, 81),
       (0, 0, 0, 25, 82),
       (0, 0, 0, 25, 83),
       (0, 0, 0, 25, 84),
       (0, 0, 0, 25, 85),
       (0, 0, 0, 25, 86),
       (0, 0, 0, 25, 87),
       (0, 0, 0, 25, 88),
       (0, 0, 0, 25, 89),
       (0, 0, 0, 25, 90),
       (0, 0, 0, 25, 91),
       (0, 0, 0, 25, 92),
       (0, 0, 0, 25, 93),
       (0, 0, 0, 25, 94),
       (0, 0, 0, 25, 95),
       (0, 0, 0, 25, 96),
       (0, 0, 0, 25, 97),
       (0, 0, 0, 25, 98),
       (0, 0, 0, 25, 99),
       (0, 0, 0, 25, 100);



/* ====== workflow start ======== */
insert into groupworks.workflow (approval_count, approver_count, status, work_flow_type, approval_date, cost, department_id, draft_date, employee_id, final_employee_id, workflow_id, description, code, department, email, employee_name, employee_rank, final_approval_department, final_approval_name, final_approval_rank, phone, title)
values  (2, 3, 2, 5, '2024-08-01 00:18:21.000000', 0, 1, '2024-07-29 00:18:21.000000', 10, 1, 1, '기술부서 146B57 보고서 관련 결재 요청입니다.', 'ece3d930-9bb1-48bc-bc31-00f23f80503a', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 146B57 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 2, '2024-08-14 10:43:16.000000', 1200000, 1, '2024-08-11 10:43:16.000000', 10, 1, 2, '기술부서 966828 재무 결산입니다.', '28ae280d-6bb3-43e8-8948-4b13e2a9b717', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 966828 재무 결산입니다.'),
        (0, 3, 0, 6, null, 0, 1, '2024-06-29 04:29:55.000000', 10, 1, 3, '기술부서 EB65AC 문제 발생 관련하여 결재 요청바랍니다.', 'c2909956-53ac-4bb5-b4fa-49cd27705340', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 EB65AC 문제 발생 관련하여 결재 요청바랍니다.'),
        (0, 3, 0, 5, null, 0, 1, '2024-05-16 13:53:30.000000', 10, 1, 4, '기술부서 CA9E0B 보고서 관련 결재 요청입니다.', 'de0890d1-9e85-4b05-b932-0121951286f3', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 CA9E0B 보고서 관련 결재 요청입니다.'),
        (1, 3, 3, 1, '2024-08-16 02:54:20.000000', 0, 1, '2024-08-15 02:54:20.000000', 10, 1, 5, '기술부서 B6E3BC 업무 기안 결재', 'd8072ad7-a5ab-4da6-be0d-ce71409b616b', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 B6E3BC 업무 기안 결재'),
        (1, 3, 2, 3, '2024-03-25 07:38:46.000000', 1200000, 1, '2024-03-22 07:38:46.000000', 10, 1, 6, '기술부서 31FC43 예산 기안 요청', '718f91ca-f280-489e-b151-f432e79b9a4a', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 31FC43 예산 기안 요청'),
        (0, 3, 0, 2, null, 0, 2, '2024-05-16 06:43:55.000000', 20, 11, 7, '마케팅부서 D15C6C 재무 결산입니다.', 'a3be0fc4-dae8-4033-aac7-ddb5202af3b3', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 D15C6C 재무 결산입니다.'),
        (2, 3, 2, 5, '2024-02-15 08:41:23.000000', 0, 2, '2024-02-12 08:41:23.000000', 20, 11, 8, '마케팅부서 223250 보고서 관련 결재 요청입니다.', '39031ca2-8b86-4510-a4c8-8f55a7b2fd0b', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 223250 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 2, '2024-01-05 18:49:16.000000', 2400000, 2, '2024-01-02 18:49:16.000000', 20, 11, 9, '마케팅부서 AA7210 재무 결산입니다.', 'e5b34a72-8bb4-40cf-8c35-fc7cf2397466', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 AA7210 재무 결산입니다.'),
        (3, 3, 1, 5, '2024-03-06 06:04:23.000000', 0, 2, '2024-03-03 06:04:23.000000', 20, 11, 10, '마케팅부서 6F18FC 보고서 관련 결재 요청입니다.', 'b90b71ba-e43d-47dc-9d1e-0df409beed5c', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 6F18FC 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 1, '2024-06-11 10:40:55.000000', 1200000, 2, '2024-06-08 10:40:55.000000', 20, 11, 11, '마케팅부서 9D77BF 업무 기안 결재', '0c1879a9-2c7d-4def-aa5e-22586e2e629c', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 9D77BF 업무 기안 결재'),
        (0, 3, 0, 2, null, 2400000, 2, '2024-05-04 14:05:53.000000', 20, 11, 12, '마케팅부서 CBBCCA 재무 결산입니다.', '04795956-025f-4767-b61f-507ac7194d88', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 CBBCCA 재무 결산입니다.'),
        (1, 3, 2, 2, '2024-08-04 07:19:14.000000', 0, 3, '2024-08-01 07:19:14.000000', 30, 21, 13, '영업부서 624F5D 재무 결산입니다.', '58b3c76a-b41c-4077-8cdf-ff6c4b34638e', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 624F5D 재무 결산입니다.'),
        (1, 3, 2, 6, '2024-06-02 09:55:12.000000', 0, 3, '2024-05-30 09:55:12.000000', 30, 21, 14, '영업부서 41CB8E 문제 발생 관련하여 결재 요청바랍니다.', '17d04b2e-57a2-4a17-9670-7d94e892f4a4', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 41CB8E 문제 발생 관련하여 결재 요청바랍니다.'),
        (3, 3, 1, 2, '2024-03-29 22:48:48.000000', 2400000, 3, '2024-03-26 22:48:48.000000', 30, 21, 15, '영업부서 F67C37 재무 결산입니다.', '7865c605-b80a-46e6-8406-66b424adaa4c', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 F67C37 재무 결산입니다.'),
        (1, 3, 2, 6, '2024-05-03 14:30:40.000000', 1200000, 3, '2024-04-30 14:30:40.000000', 30, 21, 16, '영업부서 5A6145 문제 발생 관련하여 결재 요청바랍니다.', 'c21714b4-57f5-404a-a3a9-60aaa747bf50', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 5A6145 문제 발생 관련하여 결재 요청바랍니다.'),
        (1, 3, 2, 6, '2024-01-11 07:05:13.000000', 1200000, 3, '2024-01-08 07:05:13.000000', 30, 21, 17, '영업부서 AEBBB8 문제 발생 관련하여 결재 요청바랍니다.', 'f9e5f617-c961-4ccd-bdfb-b8942d3f8f74', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 AEBBB8 문제 발생 관련하여 결재 요청바랍니다.'),
        (1, 3, 2, 2, '2024-03-10 20:10:16.000000', 0, 3, '2024-03-07 20:10:16.000000', 30, 21, 18, '영업부서 49B0FD 재무 결산입니다.', '73f47ffc-83a7-44eb-8e67-bb50723f73f0', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 49B0FD 재무 결산입니다.'),
        (1, 3, 2, 3, '2024-08-06 10:14:27.000000', 1200000, 4, '2024-08-03 10:14:27.000000', 40, 31, 19, '인사부서 BDD4CE 예산 기안 요청', '4ece0a5d-05ab-424f-b65f-53b8d23e0005', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 BDD4CE 예산 기안 요청'),
        (0, 3, 0, 2, null, 1200000, 4, '2024-01-06 17:19:13.000000', 40, 31, 20, '인사부서 D1F2FF 재무 결산입니다.', '7c790659-f819-4404-9c21-5d1c21923418', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 D1F2FF 재무 결산입니다.'),
        (3, 3, 1, 5, '2024-02-16 23:26:53.000000', 0, 4, '2024-02-13 23:26:53.000000', 40, 31, 21, '인사부서 05F130 보고서 관련 결재 요청입니다.', '0cf5dd40-2157-4800-a598-5887349755be', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 05F130 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 5, '2024-08-01 09:15:37.000000', 0, 4, '2024-07-29 09:15:37.000000', 40, 31, 22, '인사부서 2434C0 보고서 관련 결재 요청입니다.', '1bf8bc2e-690f-401d-bd72-802fc0bca16e', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 2434C0 보고서 관련 결재 요청입니다.'),
        (1, 3, 2, 3, '2024-03-10 02:11:21.000000', 2400000, 4, '2024-03-07 02:11:21.000000', 40, 31, 23, '인사부서 691D42 예산 기안 요청', '1e563350-359c-4c1b-8c6a-aacfa02a9985', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 691D42 예산 기안 요청'),
        (0, 3, 0, 1, null, 0, 4, '2024-05-07 00:29:01.000000', 40, 31, 24, '인사부서 06A004 업무 기안 결재', '80900595-9468-4733-938c-2a2a316208b1', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 06A004 업무 기안 결재'),
        (0, 3, 0, 4, null, 2400000, 5, '2024-08-19 05:27:39.000000', 50, 41, 25, '재무부서 0A81E9 비품 구매사항 비용 청구입니다.', 'a046fcf6-2d0f-47bd-9d30-0be6aaeb8fd2', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 0A81E9 비품 구매사항 비용 청구입니다.'),
        (3, 3, 3, 6, '2024-04-21 12:32:36.000000', 1200000, 5, '2024-04-18 12:32:36.000000', 50, 41, 26, '재무부서 F79F94 문제 발생 관련하여 결재 요청바랍니다.', 'a7593eb9-92be-4c39-96da-24606e446d05', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 F79F94 문제 발생 관련하여 결재 요청바랍니다.'),
        (3, 3, 1, 6, '2024-04-20 07:46:01.000000', 2400000, 5, '2024-04-17 07:46:01.000000', 50, 41, 27, '재무부서 4993CE 문제 발생 관련하여 결재 요청바랍니다.', '14d7f57e-0d8e-43b1-ba6f-94f06b9f8c15', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 4993CE 문제 발생 관련하여 결재 요청바랍니다.'),
        (1, 3, 2, 4, '2024-08-18 20:16:29.000000', 1200000, 5, '2024-08-15 20:16:29.000000', 50, 41, 28, '재무부서 EB103D 비품 구매사항 비용 청구입니다.', '0aec085e-8129-40c2-8aff-0ee23cf14269', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 EB103D 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 4, '2024-07-08 00:00:23.000000', 2400000, 5, '2024-07-05 00:00:23.000000', 50, 41, 29, '재무부서 41BFCF 비품 구매사항 비용 청구입니다.', 'd384d502-935c-4dff-9990-81f80d9192a4', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 41BFCF 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 6, '2024-07-13 18:24:27.000000', 1200000, 5, '2024-07-10 18:24:27.000000', 50, 41, 30, '재무부서 FC5C98 문제 발생 관련하여 결재 요청바랍니다.', 'fd9e46ac-3b90-471f-9959-e44885544420', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 FC5C98 문제 발생 관련하여 결재 요청바랍니다.'),
        (3, 3, 1, 2, '2024-05-17 18:16:31.000000', 1200000, 6, '2024-05-14 18:16:31.000000', 60, 51, 31, 'IT 지원부서 E62AA6 재무 결산입니다.', '38e5278d-8f0b-4b54-8ef2-375580c15b25', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 E62AA6 재무 결산입니다.'),
        (0, 3, 0, 4, null, 1200000, 6, '2024-02-16 20:11:46.000000', 60, 51, 32, 'IT 지원부서 4238D0 비품 구매사항 비용 청구입니다.', '2578ce61-b134-4fc6-b054-91690083f458', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 4238D0 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 2, '2024-06-20 21:25:50.000000', 1200000, 6, '2024-06-17 21:25:50.000000', 60, 51, 33, 'IT 지원부서 AC3EE3 재무 결산입니다.', '781af022-7e5a-4277-bc93-6f3f616da55d', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 AC3EE3 재무 결산입니다.'),
        (1, 3, 3, 3, '2024-03-09 20:42:56.000000', 1200000, 6, '2024-03-08 20:42:56.000000', 60, 51, 34, 'IT 지원부서 40B7DD 예산 기안 요청', 'c838433d-a4b2-48f3-92a3-f57a39fd83fe', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 40B7DD 예산 기안 요청'),
        (0, 3, 0, 3, null, 1200000, 6, '2024-01-02 18:17:05.000000', 60, 51, 35, 'IT 지원부서 2B2002 예산 기안 요청', '02dee9bd-03b9-4709-957e-2d9135bca9da', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 2B2002 예산 기안 요청'),
        (0, 3, 0, 6, null, 0, 6, '2024-03-18 12:36:32.000000', 60, 51, 36, 'IT 지원부서 E992B9 문제 발생 관련하여 결재 요청바랍니다.', 'c1a2ef29-0d24-41ff-930e-282577e19416', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 E992B9 문제 발생 관련하여 결재 요청바랍니다.'),
        (1, 3, 2, 6, '2024-03-29 05:33:48.000000', 0, 7, '2024-03-26 05:33:48.000000', 70, 61, 37, '제품 관리부서 1B5637 문제 발생 관련하여 결재 요청바랍니다.', 'b14c6f99-492d-4562-ac38-b54cdc72ae07', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 1B5637 문제 발생 관련하여 결재 요청바랍니다.'),
        (2, 3, 2, 3, '2024-05-18 23:40:01.000000', 0, 7, '2024-05-15 23:40:01.000000', 70, 61, 38, '제품 관리부서 E8AEB4 예산 기안 요청', 'a8e175f2-7bc0-4592-9248-b5ccab33fe13', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 E8AEB4 예산 기안 요청'),
        (2, 3, 3, 4, '2024-08-15 03:34:51.000000', 0, 7, '2024-08-13 03:34:51.000000', 70, 61, 39, '제품 관리부서 B74E09 비품 구매사항 비용 청구입니다.', '80fc0782-6144-409e-8486-6fef1e52f262', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 B74E09 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 2, '2024-07-13 02:25:28.000000', 2400000, 7, '2024-07-10 02:25:28.000000', 70, 61, 40, '제품 관리부서 8648DD 재무 결산입니다.', '03ac2fe7-4af5-4514-af34-c53f0f90a58e', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 8648DD 재무 결산입니다.'),
        (1, 3, 2, 3, '2024-03-29 09:46:06.000000', 2400000, 7, '2024-03-26 09:46:06.000000', 70, 61, 41, '제품 관리부서 9B730D 예산 기안 요청', '75656be0-87b1-4819-8bb6-fd5b46750882', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 9B730D 예산 기안 요청'),
        (0, 3, 0, 2, null, 0, 7, '2024-03-17 19:15:07.000000', 70, 61, 42, '제품 관리부서 A0E8D7 재무 결산입니다.', '46bd7132-21bb-4910-b410-f62732ca6a01', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 A0E8D7 재무 결산입니다.'),
        (3, 3, 1, 5, '2024-08-04 00:39:33.000000', 0, 8, '2024-08-01 00:39:33.000000', 80, 71, 43, '고객 서비스부서 CC34BE 보고서 관련 결재 요청입니다.', '5df2ee4f-6c7a-4404-928a-f802cb3b634b', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 CC34BE 보고서 관련 결재 요청입니다.'),
        (1, 3, 2, 4, '2024-02-05 23:33:26.000000', 2400000, 8, '2024-02-02 23:33:26.000000', 80, 71, 44, '고객 서비스부서 0F737C 비품 구매사항 비용 청구입니다.', '96e1546e-2f26-4f55-a39f-59897cb6537f', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 0F737C 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 6, '2024-05-28 22:29:12.000000', 0, 8, '2024-05-25 22:29:12.000000', 80, 71, 45, '고객 서비스부서 8CAF3D 문제 발생 관련하여 결재 요청바랍니다.', '84c0daa1-2efc-46b3-9918-8163edd99f63', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 8CAF3D 문제 발생 관련하여 결재 요청바랍니다.'),
        (2, 3, 2, 4, '2024-08-01 19:46:19.000000', 0, 8, '2024-07-29 19:46:19.000000', 80, 71, 46, '고객 서비스부서 BF96A7 비품 구매사항 비용 청구입니다.', '599e5f00-f763-473a-8966-6b52bee5343e', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 BF96A7 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 3, '2024-02-09 20:36:16.000000', 2400000, 8, '2024-02-06 20:36:16.000000', 80, 71, 47, '고객 서비스부서 440A88 예산 기안 요청', '45f8ae7e-cb75-41d9-9916-cb52d5e400c8', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 440A88 예산 기안 요청'),
        (3, 3, 1, 1, '2024-06-19 07:36:50.000000', 0, 8, '2024-06-16 07:36:50.000000', 80, 71, 48, '고객 서비스부서 67541C 업무 기안 결재', '7cd94423-5617-4ab0-9492-601cd296ade9', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 67541C 업무 기안 결재'),
        (3, 3, 1, 4, '2024-08-16 04:04:30.000000', 1200000, 9, '2024-08-13 04:04:30.000000', 90, 81, 49, '법무부서 ACFD35 비품 구매사항 비용 청구입니다.', '1e05279e-5032-4a62-94e3-7d4034c67ee9', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 ACFD35 비품 구매사항 비용 청구입니다.'),
        (1, 3, 3, 4, '2024-05-04 22:09:13.000000', 0, 9, '2024-05-03 22:09:13.000000', 90, 81, 50, '법무부서 42D690 비품 구매사항 비용 청구입니다.', 'fef9487d-4cf9-4960-8b90-3f07067d373c', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 42D690 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 3, '2024-08-16 15:40:15.000000', 1200000, 9, '2024-08-13 15:40:15.000000', 90, 81, 51, '법무부서 7444EC 예산 기안 요청', 'f740e18f-34ac-454f-a2b1-2c85b957cf9d', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 7444EC 예산 기안 요청'),
        (3, 3, 1, 2, '2024-04-19 11:09:05.000000', 1200000, 9, '2024-04-16 11:09:05.000000', 90, 81, 52, '법무부서 A869FE 재무 결산입니다.', 'cc01d86a-81f9-4026-bd98-0a89defbc4d5', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 A869FE 재무 결산입니다.'),
        (1, 3, 2, 5, '2024-06-05 00:12:32.000000', 0, 9, '2024-06-02 00:12:32.000000', 90, 81, 53, '법무부서 43E5ED 보고서 관련 결재 요청입니다.', 'dba05752-5606-4a86-ad03-d84e2bbb0774', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 43E5ED 보고서 관련 결재 요청입니다.'),
        (1, 3, 2, 2, '2024-04-10 06:14:55.000000', 2400000, 9, '2024-04-07 06:14:55.000000', 90, 81, 54, '법무부서 1ECD1A 재무 결산입니다.', '8cb9b66e-8890-4881-8f93-e1b7cda42aa8', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 1ECD1A 재무 결산입니다.'),
        (1, 3, 2, 5, '2024-03-26 00:57:10.000000', 0, 10, '2024-03-23 00:57:10.000000', 100, 91, 55, '연구개발부서 227C5E 보고서 관련 결재 요청입니다.', '3d15a0ea-a92f-4f98-8478-52a361190ceb', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 227C5E 보고서 관련 결재 요청입니다.'),
        (0, 3, 0, 5, null, 0, 10, '2024-05-20 05:52:47.000000', 100, 91, 56, '연구개발부서 D02CCC 보고서 관련 결재 요청입니다.', '94f6291e-1f3b-417c-898d-f377fb5be552', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 D02CCC 보고서 관련 결재 요청입니다.'),
        (0, 3, 0, 6, null, 0, 10, '2024-06-18 21:31:15.000000', 100, 91, 57, '연구개발부서 0994C6 문제 발생 관련하여 결재 요청바랍니다.', '3222ef42-9598-4cf0-b919-e481d84d71c7', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 0994C6 문제 발생 관련하여 결재 요청바랍니다.'),
        (3, 3, 1, 3, '2024-07-21 20:10:06.000000', 1200000, 10, '2024-07-18 20:10:06.000000', 100, 91, 58, '연구개발부서 E18F8B 예산 기안 요청', '5dec51e8-3628-4556-afa2-031a72498593', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 E18F8B 예산 기안 요청'),
        (2, 3, 2, 5, '2024-01-09 03:36:24.000000', 0, 10, '2024-01-06 03:36:24.000000', 100, 91, 59, '연구개발부서 5D8FE9 보고서 관련 결재 요청입니다.', '57e68bd0-987c-462e-8c7c-f30637bcc2c0', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 5D8FE9 보고서 관련 결재 요청입니다.'),
        (1, 3, 3, 2, '2024-05-16 15:11:35.000000', 0, 10, '2024-05-15 15:11:35.000000', 100, 91, 60, '연구개발부서 34EB55 재무 결산입니다.', '2fe383ae-f42e-4233-be60-20b471cea9ad', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 34EB55 재무 결산입니다.'),
        (0, 3, 0, 2, null, 1200000, 1, '2024-05-12 15:53:06.000000', 10, 1, 61, '기술부서 AF0462 재무 결산입니다.', '51241c9a-1b83-4160-8a6c-7c3d9e45f18d', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 AF0462 재무 결산입니다.'),
        (3, 3, 1, 1, '2024-02-03 09:07:05.000000', 0, 1, '2024-01-31 09:07:05.000000', 10, 1, 62, '기술부서 5FA96E 업무 기안 결재', 'ec300e98-92a9-4ab5-ad85-80b93cdb1e14', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 5FA96E 업무 기안 결재'),
        (1, 3, 2, 2, '2024-01-09 07:58:56.000000', 0, 1, '2024-01-06 07:58:56.000000', 10, 1, 63, '기술부서 A207B3 재무 결산입니다.', '0f0318ac-88e2-42a0-b059-7d12a0369426', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 A207B3 재무 결산입니다.'),
        (3, 3, 1, 4, '2024-06-25 06:33:03.000000', 0, 1, '2024-06-22 06:33:03.000000', 10, 1, 64, '기술부서 E623A1 비품 구매사항 비용 청구입니다.', '0bf16d53-2302-4054-b866-791421cd642f', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 E623A1 비품 구매사항 비용 청구입니다.'),
        (3, 3, 3, 5, '2024-07-11 03:35:23.000000', 0, 1, '2024-07-08 03:35:23.000000', 10, 1, 65, '기술부서 7FC5A0 보고서 관련 결재 요청입니다.', '869ef0b6-bb3d-4dcf-b3bd-e6eabb741cfb', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 7FC5A0 보고서 관련 결재 요청입니다.'),
        (0, 3, 0, 1, null, 0, 1, '2024-08-07 20:09:25.000000', 10, 1, 66, '기술부서 74AAC0 업무 기안 결재', '8377908e-e9f0-4824-bf50-b95a242762ad', '기술부서', 'employee10@gw.com', '사원10', '사원', '기술부서', '사원1', '부장', '010-1111-1109', '기술부서 74AAC0 업무 기안 결재'),
        (0, 3, 0, 3, null, 1200000, 2, '2024-06-09 12:11:14.000000', 20, 11, 67, '마케팅부서 B434FB 예산 기안 요청', '6e0a7799-693b-45b9-a186-176db8c20a24', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 B434FB 예산 기안 요청'),
        (1, 3, 3, 3, '2024-07-10 15:38:06.000000', 2400000, 2, '2024-07-09 15:38:06.000000', 20, 11, 68, '마케팅부서 AE04F3 예산 기안 요청', '3d062d38-b43f-4701-99fd-da392e50f383', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 AE04F3 예산 기안 요청'),
        (0, 3, 0, 1, null, 0, 2, '2024-01-28 16:36:50.000000', 20, 11, 69, '마케팅부서 9E114E 업무 기안 결재', '7a661371-fb61-4ace-86b3-dda5af2182d4', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 9E114E 업무 기안 결재'),
        (3, 3, 1, 3, '2024-04-25 00:39:18.000000', 2400000, 2, '2024-04-22 00:39:18.000000', 20, 11, 70, '마케팅부서 DB22F2 예산 기안 요청', '70f3c581-4dcc-46a5-ae40-b79eb190c39d', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 DB22F2 예산 기안 요청'),
        (0, 3, 0, 3, null, 1200000, 2, '2024-02-22 14:46:42.000000', 20, 11, 71, '마케팅부서 06BA47 예산 기안 요청', '871609e1-f365-42e6-bd26-8f31ab8c8692', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 06BA47 예산 기안 요청'),
        (2, 3, 2, 4, '2024-03-26 23:32:58.000000', 0, 2, '2024-03-23 23:32:58.000000', 20, 11, 72, '마케팅부서 5A7DCE 비품 구매사항 비용 청구입니다.', 'c78cc136-dda9-45ad-8ce8-ba43ce4e3ec9', '마케팅부서', 'employee20@gw.com', '사원20', '사원', '마케팅부서', '사원11', '부장', '010-1111-1119', '마케팅부서 5A7DCE 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 3, '2024-05-21 09:18:43.000000', 1200000, 3, '2024-05-18 09:18:43.000000', 30, 21, 73, '영업부서 77F488 예산 기안 요청', '2751d6dc-fb4e-49bd-8299-4f1f2b00489a', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 77F488 예산 기안 요청'),
        (3, 3, 1, 1, '2024-08-13 14:01:27.000000', 0, 3, '2024-08-10 14:01:27.000000', 30, 21, 74, '영업부서 1B21D2 업무 기안 결재', 'dfee002b-c952-4ec6-b738-f874ad3ee950', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 1B21D2 업무 기안 결재'),
        (1, 3, 3, 2, '2024-06-06 19:39:27.000000', 2400000, 3, '2024-06-05 19:39:27.000000', 30, 21, 75, '영업부서 6569E2 재무 결산입니다.', '1fb1e4f3-40eb-4e6f-9752-4f54bb715fad', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 6569E2 재무 결산입니다.'),
        (0, 3, 0, 1, null, 2400000, 3, '2024-07-24 10:15:43.000000', 30, 21, 76, '영업부서 C8635B 업무 기안 결재', '55b79140-58b7-479b-a810-ea178b462cd3', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 C8635B 업무 기안 결재'),
        (1, 3, 2, 1, '2024-07-01 12:27:32.000000', 1200000, 3, '2024-06-28 12:27:32.000000', 30, 21, 77, '영업부서 159AEA 업무 기안 결재', 'e6428b5b-3819-41e9-83fe-fc41a2e7d475', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 159AEA 업무 기안 결재'),
        (0, 3, 0, 2, null, 2400000, 3, '2024-02-25 15:01:02.000000', 30, 21, 78, '영업부서 F69E81 재무 결산입니다.', '7ef3d546-a7df-4886-aa3b-43597986b9a9', '영업부서', 'employee30@gw.com', '사원30', '사원', '영업부서', '사원21', '부장', '010-1111-1129', '영업부서 F69E81 재무 결산입니다.'),
        (3, 3, 1, 1, '2024-07-09 11:32:18.000000', 0, 4, '2024-07-06 11:32:18.000000', 40, 31, 79, '인사부서 782EB2 업무 기안 결재', '862920c3-bcca-4723-8453-b7127069371e', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 782EB2 업무 기안 결재'),
        (1, 3, 3, 4, '2024-03-27 12:47:51.000000', 1200000, 4, '2024-03-26 12:47:51.000000', 40, 31, 80, '인사부서 20BC4C 비품 구매사항 비용 청구입니다.', '00e82294-b609-45d9-aea9-b766de26f8dd', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 20BC4C 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 4, '2024-04-09 01:59:17.000000', 1200000, 4, '2024-04-06 01:59:17.000000', 40, 31, 81, '인사부서 12E2DA 비품 구매사항 비용 청구입니다.', '323f6c4b-2858-46b4-9e21-fc525e113f28', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 12E2DA 비품 구매사항 비용 청구입니다.'),
        (1, 3, 3, 3, '2024-02-07 17:02:50.000000', 0, 4, '2024-02-06 17:02:50.000000', 40, 31, 82, '인사부서 DB4C64 예산 기안 요청', '33e547c0-5de7-4fb7-bbe8-68da79d9bfc5', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 DB4C64 예산 기안 요청'),
        (3, 3, 1, 2, '2024-02-06 08:40:19.000000', 0, 4, '2024-02-03 08:40:19.000000', 40, 31, 83, '인사부서 ABACAB 재무 결산입니다.', '74bef071-46b5-4e20-9ea7-b4e0e82dc70e', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 ABACAB 재무 결산입니다.'),
        (0, 3, 0, 3, null, 2400000, 4, '2024-04-28 19:51:39.000000', 40, 31, 84, '인사부서 C470A2 예산 기안 요청', '3c83dfe7-2740-4189-914a-12602413f896', '인사부서', 'employee40@gw.com', '사원40', '사원', '인사부서', '사원31', '부장', '010-1111-1139', '인사부서 C470A2 예산 기안 요청'),
        (1, 3, 2, 1, '2024-02-06 10:06:26.000000', 1200000, 5, '2024-02-03 10:06:26.000000', 50, 41, 85, '재무부서 705BAD 업무 기안 결재', 'ac73dafe-5460-49c4-b9cf-cf79c79be66a', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 705BAD 업무 기안 결재'),
        (2, 3, 2, 5, '2024-04-27 02:08:37.000000', 1200000, 5, '2024-04-24 02:08:37.000000', 50, 41, 86, '재무부서 C51310 보고서 관련 결재 요청입니다.', '1e166a37-f471-4b3d-867d-ccb6d5faf8a7', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 C51310 보고서 관련 결재 요청입니다.'),
        (1, 3, 2, 5, '2024-01-23 06:21:53.000000', 2400000, 5, '2024-01-20 06:21:53.000000', 50, 41, 87, '재무부서 E5B870 보고서 관련 결재 요청입니다.', '968e5257-2ab0-42fe-8726-b58b7a1d5c82', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 E5B870 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 1, '2024-08-15 14:30:43.000000', 0, 5, '2024-08-12 14:30:43.000000', 50, 41, 88, '재무부서 FA7CA3 업무 기안 결재', '74b19003-e45f-4a07-a899-60a552dfb39c', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 FA7CA3 업무 기안 결재'),
        (3, 3, 1, 4, '2024-03-03 05:59:14.000000', 1200000, 5, '2024-02-29 05:59:14.000000', 50, 41, 89, '재무부서 ACEEB8 비품 구매사항 비용 청구입니다.', '822c75f7-be0f-482d-9180-3432cd913908', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 ACEEB8 비품 구매사항 비용 청구입니다.'),
        (1, 3, 3, 5, '2024-03-01 07:29:45.000000', 1200000, 5, '2024-02-29 07:29:45.000000', 50, 41, 90, '재무부서 7296D2 보고서 관련 결재 요청입니다.', '8f51716c-44f5-4576-b40c-ba3a169a6890', '재무부서', 'employee50@gw.com', '사원50', '사원', '재무부서', '사원41', '부장', '010-1111-1149', '재무부서 7296D2 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 1, '2024-02-01 16:51:04.000000', 0, 6, '2024-01-29 16:51:04.000000', 60, 51, 91, 'IT 지원부서 2858D2 업무 기안 결재', '8564897c-cb82-4af9-a074-4f0403bd57bb', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 2858D2 업무 기안 결재'),
        (2, 3, 2, 3, '2024-03-10 02:43:45.000000', 1200000, 6, '2024-03-07 02:43:45.000000', 60, 51, 92, 'IT 지원부서 72068C 예산 기안 요청', '1bfa4d48-0600-418d-be5e-9aeaad0e847b', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 72068C 예산 기안 요청'),
        (3, 3, 1, 1, '2024-05-11 10:30:19.000000', 0, 6, '2024-05-08 10:30:19.000000', 60, 51, 93, 'IT 지원부서 160338 업무 기안 결재', 'a7e348c4-c3e0-4c66-86be-99905766f099', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 160338 업무 기안 결재'),
        (3, 3, 3, 5, '2024-01-12 01:42:51.000000', 0, 6, '2024-01-09 01:42:51.000000', 60, 51, 94, 'IT 지원부서 CF2509 보고서 관련 결재 요청입니다.', 'f277acb1-1b75-46c9-a467-3d77c867e2d9', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 CF2509 보고서 관련 결재 요청입니다.'),
        (0, 3, 0, 2, null, 2400000, 6, '2024-04-28 19:38:02.000000', 60, 51, 95, 'IT 지원부서 450D30 재무 결산입니다.', 'c63218ac-f759-4008-bb4a-830719b3b28f', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 450D30 재무 결산입니다.'),
        (3, 3, 1, 1, '2024-04-16 07:57:22.000000', 0, 6, '2024-04-13 07:57:22.000000', 60, 51, 96, 'IT 지원부서 50C21C 업무 기안 결재', '73faee64-0918-415e-9d34-17ae95e8f94b', 'IT 지원부서', 'employee60@gw.com', '사원60', '사원', 'IT 지원부서', '사원51', '부장', '010-1111-1159', 'IT 지원부서 50C21C 업무 기안 결재'),
        (2, 3, 2, 4, '2024-04-28 00:54:27.000000', 1200000, 7, '2024-04-25 00:54:27.000000', 70, 61, 97, '제품 관리부서 16FBC7 비품 구매사항 비용 청구입니다.', 'cb0e2333-e8b0-4e7a-9990-a8306d4ab9e3', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 16FBC7 비품 구매사항 비용 청구입니다.'),
        (0, 3, 0, 4, null, 0, 7, '2024-07-08 12:14:00.000000', 70, 61, 98, '제품 관리부서 B6E15C 비품 구매사항 비용 청구입니다.', 'ca003d43-4c92-43df-975b-f738a67cab38', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 B6E15C 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 2, '2024-08-09 11:01:45.000000', 1200000, 7, '2024-08-06 11:01:45.000000', 70, 61, 99, '제품 관리부서 7F9462 재무 결산입니다.', '0cb57db0-da01-417d-9ac3-e874557115d2', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 7F9462 재무 결산입니다.'),
        (3, 3, 1, 1, '2024-03-27 06:37:50.000000', 0, 7, '2024-03-24 06:37:50.000000', 70, 61, 100, '제품 관리부서 35D8A4 업무 기안 결재', '0213b281-484b-43da-9a5e-6ddb78b74f25', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 35D8A4 업무 기안 결재'),
        (3, 3, 1, 2, '2024-03-01 08:30:30.000000', 1200000, 7, '2024-02-27 08:30:30.000000', 70, 61, 101, '제품 관리부서 00A30E 재무 결산입니다.', 'bdda75e9-9d9b-4a01-9bfe-9e979ec0d177', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 00A30E 재무 결산입니다.'),
        (3, 3, 1, 5, '2024-07-10 23:57:59.000000', 0, 7, '2024-07-07 23:57:59.000000', 70, 61, 102, '제품 관리부서 F003F9 보고서 관련 결재 요청입니다.', 'f7208d04-ec85-407a-952b-76a824af1223', '제품 관리부서', 'employee70@gw.com', '사원70', '사원', '제품 관리부서', '사원61', '부장', '010-1111-1169', '제품 관리부서 F003F9 보고서 관련 결재 요청입니다.'),
        (1, 3, 2, 1, '2024-06-16 11:42:05.000000', 0, 8, '2024-06-13 11:42:05.000000', 80, 71, 103, '고객 서비스부서 7DA2C9 업무 기안 결재', 'b845f21a-3757-460d-84c9-a4308e378b19', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 7DA2C9 업무 기안 결재'),
        (3, 3, 1, 4, '2024-05-29 20:25:09.000000', 1200000, 8, '2024-05-26 20:25:09.000000', 80, 71, 104, '고객 서비스부서 1C7B54 비품 구매사항 비용 청구입니다.', '6f26f700-be96-49e7-ab32-53df1cfdc5af', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 1C7B54 비품 구매사항 비용 청구입니다.'),
        (1, 3, 2, 5, '2024-02-03 18:25:17.000000', 0, 8, '2024-01-31 18:25:17.000000', 80, 71, 105, '고객 서비스부서 29EABE 보고서 관련 결재 요청입니다.', 'e7ee9454-24c4-4def-b75b-bb79d56a045d', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 29EABE 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 2, '2024-07-13 13:40:46.000000', 1200000, 8, '2024-07-10 13:40:46.000000', 80, 71, 106, '고객 서비스부서 F3B6C0 재무 결산입니다.', '4306dbc5-1eb8-49aa-9e5d-3ae3c68314cd', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 F3B6C0 재무 결산입니다.'),
        (0, 3, 0, 1, null, 0, 8, '2024-01-06 22:00:04.000000', 80, 71, 107, '고객 서비스부서 891A74 업무 기안 결재', '6a032365-d351-4e8f-9e42-1eb224c981a9', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 891A74 업무 기안 결재'),
        (3, 3, 1, 3, '2024-02-21 20:16:57.000000', 1200000, 8, '2024-02-18 20:16:57.000000', 80, 71, 108, '고객 서비스부서 B211CF 예산 기안 요청', 'bbf5bcb4-6077-4c7d-bbca-c10d96c9e13f', '고객 서비스부서', 'employee80@gw.com', '사원80', '사원', '고객 서비스부서', '사원71', '부장', '010-1111-1179', '고객 서비스부서 B211CF 예산 기안 요청'),
        (1, 3, 2, 4, '2024-08-07 02:25:02.000000', 0, 9, '2024-08-04 02:25:02.000000', 90, 81, 109, '법무부서 61272D 비품 구매사항 비용 청구입니다.', 'db48cda0-ee75-4674-8137-45641e8bec51', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 61272D 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 6, '2024-02-23 18:16:56.000000', 0, 9, '2024-02-20 18:16:56.000000', 90, 81, 110, '법무부서 D32BB5 문제 발생 관련하여 결재 요청바랍니다.', '1b6aacca-0820-423c-8f09-d2e853f5e10a', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 D32BB5 문제 발생 관련하여 결재 요청바랍니다.'),
        (1, 3, 2, 3, '2024-04-29 08:38:28.000000', 2400000, 9, '2024-04-26 08:38:28.000000', 90, 81, 111, '법무부서 C918A5 예산 기안 요청', 'a6707155-2bb8-447e-bc91-5574991a94bb', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 C918A5 예산 기안 요청'),
        (1, 3, 2, 1, '2024-04-05 01:38:30.000000', 0, 9, '2024-04-02 01:38:30.000000', 90, 81, 112, '법무부서 D7D026 업무 기안 결재', '7649b2f4-6e7d-432e-a3e3-05711acd4618', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 D7D026 업무 기안 결재'),
        (0, 3, 0, 5, null, 0, 9, '2024-01-14 17:46:11.000000', 90, 81, 113, '법무부서 942B26 보고서 관련 결재 요청입니다.', '235242eb-ff8f-49a0-a6dc-8df9c11736f1', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 942B26 보고서 관련 결재 요청입니다.'),
        (3, 3, 1, 1, '2024-05-21 01:10:20.000000', 0, 9, '2024-05-18 01:10:20.000000', 90, 81, 114, '법무부서 58E179 업무 기안 결재', '91a881cd-c667-420d-be96-1d56387ce014', '법무부서', 'employee90@gw.com', '사원90', '사원', '법무부서', '사원81', '부장', '010-1111-1189', '법무부서 58E179 업무 기안 결재'),
        (2, 3, 3, 5, '2024-02-15 03:18:57.000000', 0, 10, '2024-02-13 03:18:57.000000', 100, 91, 115, '연구개발부서 D0D881 보고서 관련 결재 요청입니다.', '1f31fdf4-4662-4b76-8bd8-abd5e8537c62', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 D0D881 보고서 관련 결재 요청입니다.'),
        (0, 3, 0, 4, null, 2400000, 10, '2024-08-08 22:36:29.000000', 100, 91, 116, '연구개발부서 57398F 비품 구매사항 비용 청구입니다.', 'ea9bb6ac-38a2-423d-a5e9-c5d6f7dd0f43', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 57398F 비품 구매사항 비용 청구입니다.'),
        (3, 3, 1, 1, '2024-05-31 20:53:30.000000', 0, 10, '2024-05-28 20:53:30.000000', 100, 91, 117, '연구개발부서 21E5AE 업무 기안 결재', '84dde900-82a9-43dd-bfc3-4be033e611ee', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 21E5AE 업무 기안 결재'),
        (3, 3, 1, 2, '2024-03-30 23:02:02.000000', 2400000, 10, '2024-03-27 23:02:02.000000', 100, 91, 118, '연구개발부서 C28A00 재무 결산입니다.', '214babdf-c429-4154-821f-e162aac070cd', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 C28A00 재무 결산입니다.'),
        (0, 3, 0, 2, null, 0, 10, '2024-06-25 10:39:42.000000', 100, 91, 119, '연구개발부서 8E8EC5 재무 결산입니다.', 'e724b13f-a196-42c5-ab32-34e0ab065cb8', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 8E8EC5 재무 결산입니다.'),
        (3, 3, 1, 6, '2024-06-20 14:26:54.000000', 0, 10, '2024-06-17 14:26:54.000000', 100, 91, 120, '연구개발부서 AFAA26 문제 발생 관련하여 결재 요청바랍니다.', '87f72aae-b52c-4664-9348-7b839d6b3c7a', '연구개발부서', 'employee100@gw.com', '사원100', '사원', '연구개발부서', '사원91', '부장', '010-1111-1199', '연구개발부서 AFAA26 문제 발생 관련하여 결재 요청바랍니다.')
        ;

insert into groupworks.workflow_approver (approval, approval_method, approver_type, sequence_num, approval_date, approver_id, employee_id, workflow_id, approver_email, approver_name, approver_phone, approver_rank, comment, department)
values  (1, 1, 1, 2, '2024-07-30 00:18:21.000000', 1, 3, 1, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '결재 승인합니다.', '기술부서'),
        (2, 5, 1, 3, '2024-08-01 00:18:21.000000', 2, 2, 1, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '반려합니디.', '기술부서'),
        (0, 5, 1, 4, null, 3, 1, 1, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-07-30 00:18:21.000000', 4, 11, 1, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-07-30 00:18:21.000000', 5, 12, 1, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-07-30 00:18:21.000000', 6, 13, 1, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 7, 4, 1, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 8, 5, 1, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 9, 6, 1, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-14 10:43:16.000000', 10, 3, 2, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '전결합니다.', '기술부서'),
        (0, 4, 1, 3, null, 11, 2, 2, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 4, 1, 4, null, 12, 1, 2, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-08-12 10:43:16.000000', 13, 11, 2, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-08-12 10:43:16.000000', 14, 12, 2, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-08-12 10:43:16.000000', 15, 13, 2, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 16, 4, 2, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 17, 5, 2, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 18, 6, 2, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 19, 3, 3, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', null, '기술부서'),
        (0, 1, 1, 3, null, 20, 2, 3, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 1, 1, 4, null, 21, 1, 3, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-06-30 04:29:55.000000', 22, 11, 3, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-06-30 04:29:55.000000', 23, 12, 3, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-06-30 04:29:55.000000', 24, 13, 3, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 25, 4, 3, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 26, 5, 3, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 27, 6, 3, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 28, 3, 4, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', null, '기술부서'),
        (0, 1, 1, 3, null, 29, 2, 4, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 1, 1, 4, null, 30, 1, 4, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-05-17 13:53:30.000000', 31, 11, 4, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-05-17 13:53:30.000000', 32, 12, 4, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-05-17 13:53:30.000000', 33, 13, 4, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 34, 4, 4, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 35, 5, 4, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 36, 6, 4, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-08-16 02:54:20.000000', 37, 3, 5, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '결재 승인합니다.', '기술부서'),
        (0, 1, 1, 3, null, 38, 2, 5, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 1, 1, 4, null, 39, 1, 5, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-08-16 02:54:20.000000', 40, 11, 5, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-08-16 02:54:20.000000', 41, 12, 5, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-08-16 02:54:20.000000', 42, 13, 5, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 43, 4, 5, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 44, 5, 5, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 45, 6, 5, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-25 07:38:46.000000', 46, 3, 6, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '반려합니디.', '기술부서'),
        (0, 5, 1, 3, null, 47, 2, 6, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 5, 1, 4, null, 48, 1, 6, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-03-23 07:38:46.000000', 49, 11, 6, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-03-23 07:38:46.000000', 50, 12, 6, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-03-23 07:38:46.000000', 51, 13, 6, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 52, 4, 6, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 53, 5, 6, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 54, 6, 6, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 55, 13, 7, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', null, '마케팅부서'),
        (0, 1, 1, 3, null, 56, 12, 7, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 57, 11, 7, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-05-17 06:43:55.000000', 58, 1, 7, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-17 06:43:55.000000', 59, 2, 7, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-17 06:43:55.000000', 60, 3, 7, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 61, 4, 7, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 62, 5, 7, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 63, 6, 7, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-13 08:41:23.000000', 64, 13, 8, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '결재 승인합니다.', '마케팅부서'),
        (2, 5, 1, 3, '2024-02-15 08:41:23.000000', 65, 12, 8, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '반려합니디.', '마케팅부서'),
        (0, 5, 1, 4, null, 66, 11, 8, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-02-13 08:41:23.000000', 67, 1, 8, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-13 08:41:23.000000', 68, 2, 8, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-13 08:41:23.000000', 69, 3, 8, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 70, 4, 8, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 71, 5, 8, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 72, 6, 8, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-01-05 18:49:16.000000', 73, 13, 9, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '전결합니다.', '마케팅부서'),
        (0, 4, 1, 3, null, 74, 12, 9, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 4, 1, 4, null, 75, 11, 9, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-01-03 18:49:16.000000', 76, 1, 9, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-03 18:49:16.000000', 77, 2, 9, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-03 18:49:16.000000', 78, 3, 9, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 79, 4, 9, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 80, 5, 9, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 81, 6, 9, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-03-06 06:04:23.000000', 82, 13, 10, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '전결합니다.', '마케팅부서'),
        (0, 4, 1, 3, null, 83, 12, 10, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 4, 1, 4, null, 84, 11, 10, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-03-04 06:04:23.000000', 85, 1, 10, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-04 06:04:23.000000', 86, 2, 10, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-04 06:04:23.000000', 87, 3, 10, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 88, 4, 10, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 89, 5, 10, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 90, 6, 10, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-06-09 10:40:55.000000', 91, 13, 11, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '결재 승인합니다.', '마케팅부서'),
        (1, 1, 1, 3, '2024-06-09 10:40:55.000000', 92, 12, 11, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '결재 승인합니다.', '마케팅부서'),
        (1, 4, 1, 4, '2024-06-11 10:40:55.000000', 93, 11, 11, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '전결합니다.', '마케팅부서'),
        (1, 0, 2, 2, '2024-06-09 10:40:55.000000', 94, 1, 11, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-09 10:40:55.000000', 95, 2, 11, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-09 10:40:55.000000', 96, 3, 11, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 97, 4, 11, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 98, 5, 11, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 99, 6, 11, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 100, 13, 12, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', null, '마케팅부서'),
        (0, 1, 1, 3, null, 101, 12, 12, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 102, 11, 12, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-05-05 14:05:53.000000', 103, 1, 12, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-05 14:05:53.000000', 104, 2, 12, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-05 14:05:53.000000', 105, 3, 12, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 106, 4, 12, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 107, 5, 12, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 108, 6, 12, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-08-04 07:19:14.000000', 109, 23, 13, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 110, 22, 13, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 111, 21, 13, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-08-02 07:19:14.000000', 112, 1, 13, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-02 07:19:14.000000', 113, 2, 13, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-02 07:19:14.000000', 114, 3, 13, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 115, 4, 13, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 116, 5, 13, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 117, 6, 13, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-06-02 09:55:12.000000', 118, 23, 14, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 119, 22, 14, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 120, 21, 14, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-05-31 09:55:12.000000', 121, 1, 14, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-31 09:55:12.000000', 122, 2, 14, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-31 09:55:12.000000', 123, 3, 14, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 124, 4, 14, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 125, 5, 14, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 126, 6, 14, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-03-29 22:48:48.000000', 127, 23, 15, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '전결합니다.', '영업부서'),
        (0, 4, 1, 3, null, 128, 22, 15, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 4, 1, 4, null, 129, 21, 15, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-03-27 22:48:48.000000', 130, 1, 15, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-27 22:48:48.000000', 131, 2, 15, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-27 22:48:48.000000', 132, 3, 15, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 133, 4, 15, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 134, 5, 15, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 135, 6, 15, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-05-03 14:30:40.000000', 136, 23, 16, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 137, 22, 16, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 138, 21, 16, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-05-01 14:30:40.000000', 139, 1, 16, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-01 14:30:40.000000', 140, 2, 16, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-01 14:30:40.000000', 141, 3, 16, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 142, 4, 16, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 143, 5, 16, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 144, 6, 16, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-01-11 07:05:13.000000', 145, 23, 17, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 146, 22, 17, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 147, 21, 17, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-01-09 07:05:13.000000', 148, 1, 17, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-09 07:05:13.000000', 149, 2, 17, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-09 07:05:13.000000', 150, 3, 17, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 151, 4, 17, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 152, 5, 17, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 153, 6, 17, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-10 20:10:16.000000', 154, 23, 18, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 155, 22, 18, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 156, 21, 18, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-03-08 20:10:16.000000', 157, 1, 18, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-08 20:10:16.000000', 158, 2, 18, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-08 20:10:16.000000', 159, 3, 18, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 160, 4, 18, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 161, 5, 18, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 162, 6, 18, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-08-06 10:14:27.000000', 163, 33, 19, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '반려합니디.', '인사부서'),
        (0, 5, 1, 3, null, 164, 32, 19, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 5, 1, 4, null, 165, 31, 19, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-08-04 10:14:27.000000', 166, 1, 19, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-04 10:14:27.000000', 167, 2, 19, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-04 10:14:27.000000', 168, 3, 19, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 169, 4, 19, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 170, 5, 19, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 171, 6, 19, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 172, 33, 20, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', null, '인사부서'),
        (0, 1, 1, 3, null, 173, 32, 20, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 1, 1, 4, null, 174, 31, 20, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-01-07 17:19:13.000000', 175, 1, 20, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-07 17:19:13.000000', 176, 2, 20, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-07 17:19:13.000000', 177, 3, 20, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 178, 4, 20, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 179, 5, 20, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 180, 6, 20, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-02-16 23:26:53.000000', 181, 33, 21, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '전결합니다.', '인사부서'),
        (0, 4, 1, 3, null, 182, 32, 21, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 4, 1, 4, null, 183, 31, 21, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-02-14 23:26:53.000000', 184, 1, 21, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-14 23:26:53.000000', 185, 2, 21, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-14 23:26:53.000000', 186, 3, 21, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 187, 4, 21, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 188, 5, 21, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 189, 6, 21, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-01 09:15:37.000000', 190, 33, 22, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '전결합니다.', '인사부서'),
        (0, 4, 1, 3, null, 191, 32, 22, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 4, 1, 4, null, 192, 31, 22, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-07-30 09:15:37.000000', 193, 1, 22, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-30 09:15:37.000000', 194, 2, 22, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-30 09:15:37.000000', 195, 3, 22, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 196, 4, 22, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 197, 5, 22, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 198, 6, 22, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-10 02:11:21.000000', 199, 33, 23, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '반려합니디.', '인사부서'),
        (0, 5, 1, 3, null, 200, 32, 23, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 5, 1, 4, null, 201, 31, 23, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-03-08 02:11:21.000000', 202, 1, 23, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-08 02:11:21.000000', 203, 2, 23, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-08 02:11:21.000000', 204, 3, 23, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 205, 4, 23, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 206, 5, 23, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 207, 6, 23, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 208, 33, 24, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', null, '인사부서'),
        (0, 1, 1, 3, null, 209, 32, 24, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 1, 1, 4, null, 210, 31, 24, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-05-08 00:29:01.000000', 211, 1, 24, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-08 00:29:01.000000', 212, 2, 24, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-08 00:29:01.000000', 213, 3, 24, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 214, 4, 24, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 215, 5, 24, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 216, 6, 24, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 217, 43, 25, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', null, '재무부서'),
        (0, 1, 1, 3, null, 218, 42, 25, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 1, 1, 4, null, 219, 41, 25, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-08-20 05:27:39.000000', 220, 1, 25, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-20 05:27:39.000000', 221, 2, 25, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-20 05:27:39.000000', 222, 3, 25, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 223, 4, 25, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 224, 5, 25, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 225, 6, 25, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-04-19 12:32:36.000000', 226, 43, 26, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '결재 승인합니다.', '재무부서'),
        (1, 1, 1, 3, '2024-04-19 12:32:36.000000', 227, 42, 26, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', '결재 승인합니다.', '재무부서'),
        (1, 1, 1, 4, '2024-04-19 12:32:36.000000', 228, 41, 26, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', '결재 승인합니다.', '재무부서'),
        (1, 0, 2, 2, '2024-04-19 12:32:36.000000', 229, 1, 26, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-19 12:32:36.000000', 230, 2, 26, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-19 12:32:36.000000', 231, 3, 26, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 232, 4, 26, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 233, 5, 26, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 234, 6, 26, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-04-20 07:46:01.000000', 235, 43, 27, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '전결합니다.', '재무부서'),
        (0, 4, 1, 3, null, 236, 42, 27, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 4, 1, 4, null, 237, 41, 27, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-04-18 07:46:01.000000', 238, 1, 27, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-18 07:46:01.000000', 239, 2, 27, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-18 07:46:01.000000', 240, 3, 27, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 241, 4, 27, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 242, 5, 27, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 243, 6, 27, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-08-18 20:16:29.000000', 244, 43, 28, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '반려합니디.', '재무부서'),
        (0, 5, 1, 3, null, 245, 42, 28, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 5, 1, 4, null, 246, 41, 28, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-08-16 20:16:29.000000', 247, 1, 28, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-16 20:16:29.000000', 248, 2, 28, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-16 20:16:29.000000', 249, 3, 28, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 250, 4, 28, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 251, 5, 28, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 252, 6, 28, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-07-08 00:00:23.000000', 253, 43, 29, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '반려합니디.', '재무부서'),
        (0, 5, 1, 3, null, 254, 42, 29, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 5, 1, 4, null, 255, 41, 29, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-07-06 00:00:23.000000', 256, 1, 29, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-06 00:00:23.000000', 257, 2, 29, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-06 00:00:23.000000', 258, 3, 29, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 259, 4, 29, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 260, 5, 29, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 261, 6, 29, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-11 18:24:27.000000', 262, 43, 30, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '결재 승인합니다.', '재무부서'),
        (1, 4, 1, 3, '2024-07-13 18:24:27.000000', 263, 42, 30, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', '전결합니다.', '재무부서'),
        (0, 4, 1, 4, null, 264, 41, 30, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-07-11 18:24:27.000000', 265, 1, 30, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-11 18:24:27.000000', 266, 2, 30, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-11 18:24:27.000000', 267, 3, 30, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 268, 4, 30, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 269, 5, 30, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 270, 6, 30, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-05-17 18:16:31.000000', 271, 53, 31, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '전결합니다.', 'IT 지원부서'),
        (0, 4, 1, 3, null, 272, 52, 31, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 4, 1, 4, null, 273, 51, 31, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-05-15 18:16:31.000000', 274, 1, 31, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-15 18:16:31.000000', 275, 2, 31, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-15 18:16:31.000000', 276, 3, 31, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 277, 4, 31, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 278, 5, 31, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 279, 6, 31, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 280, 53, 32, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', null, 'IT 지원부서'),
        (0, 1, 1, 3, null, 281, 52, 32, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 1, 1, 4, null, 282, 51, 32, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-02-17 20:11:46.000000', 283, 1, 32, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-17 20:11:46.000000', 284, 2, 32, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-17 20:11:46.000000', 285, 3, 32, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 286, 4, 32, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 287, 5, 32, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 288, 6, 32, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-06-20 21:25:50.000000', 289, 53, 33, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '반려합니디.', 'IT 지원부서'),
        (0, 5, 1, 3, null, 290, 52, 33, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 5, 1, 4, null, 291, 51, 33, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-06-18 21:25:50.000000', 292, 1, 33, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-18 21:25:50.000000', 293, 2, 33, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-18 21:25:50.000000', 294, 3, 33, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 295, 4, 33, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 296, 5, 33, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 297, 6, 33, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-09 20:42:56.000000', 298, 53, 34, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '결재 승인합니다.', 'IT 지원부서'),
        (0, 1, 1, 3, null, 299, 52, 34, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 1, 1, 4, null, 300, 51, 34, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-03-09 20:42:56.000000', 301, 1, 34, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-09 20:42:56.000000', 302, 2, 34, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-09 20:42:56.000000', 303, 3, 34, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 304, 4, 34, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 305, 5, 34, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 306, 6, 34, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 307, 53, 35, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', null, 'IT 지원부서'),
        (0, 1, 1, 3, null, 308, 52, 35, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 1, 1, 4, null, 309, 51, 35, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-01-03 18:17:05.000000', 310, 1, 35, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-03 18:17:05.000000', 311, 2, 35, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-03 18:17:05.000000', 312, 3, 35, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 313, 4, 35, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 314, 5, 35, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 315, 6, 35, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 316, 53, 36, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', null, 'IT 지원부서'),
        (0, 1, 1, 3, null, 317, 52, 36, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 1, 1, 4, null, 318, 51, 36, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-03-19 12:36:32.000000', 319, 1, 36, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-19 12:36:32.000000', 320, 2, 36, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-19 12:36:32.000000', 321, 3, 36, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 322, 4, 36, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 323, 5, 36, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 324, 6, 36, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-29 05:33:48.000000', 325, 63, 37, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '반려합니디.', '제품 관리부서'),
        (0, 5, 1, 3, null, 326, 62, 37, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 5, 1, 4, null, 327, 61, 37, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-03-27 05:33:48.000000', 328, 1, 37, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-27 05:33:48.000000', 329, 2, 37, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-27 05:33:48.000000', 330, 3, 37, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 331, 4, 37, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 332, 5, 37, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 333, 6, 37, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-05-16 23:40:01.000000', 334, 63, 38, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '결재 승인합니다.', '제품 관리부서'),
        (2, 5, 1, 3, '2024-05-18 23:40:01.000000', 335, 62, 38, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', '반려합니디.', '제품 관리부서'),
        (0, 5, 1, 4, null, 336, 61, 38, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-05-16 23:40:01.000000', 337, 1, 38, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-16 23:40:01.000000', 338, 2, 38, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-16 23:40:01.000000', 339, 3, 38, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 340, 4, 38, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 341, 5, 38, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 342, 6, 38, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-08-14 03:34:51.000000', 343, 63, 39, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '결재 승인합니다.', '제품 관리부서'),
        (1, 1, 1, 3, '2024-08-14 03:34:51.000000', 344, 62, 39, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', '결재 승인합니다.', '제품 관리부서'),
        (0, 1, 1, 4, null, 345, 61, 39, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-08-14 03:34:51.000000', 346, 1, 39, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-14 03:34:51.000000', 347, 2, 39, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-14 03:34:51.000000', 348, 3, 39, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 349, 4, 39, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 350, 5, 39, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 351, 6, 39, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-07-13 02:25:28.000000', 352, 63, 40, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '반려합니디.', '제품 관리부서'),
        (0, 5, 1, 3, null, 353, 62, 40, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 5, 1, 4, null, 354, 61, 40, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-07-11 02:25:28.000000', 355, 1, 40, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-11 02:25:28.000000', 356, 2, 40, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-11 02:25:28.000000', 357, 3, 40, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 358, 4, 40, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 359, 5, 40, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 360, 6, 40, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-29 09:46:06.000000', 361, 63, 41, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '반려합니디.', '제품 관리부서'),
        (0, 5, 1, 3, null, 362, 62, 41, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 5, 1, 4, null, 363, 61, 41, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-03-27 09:46:06.000000', 364, 1, 41, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-27 09:46:06.000000', 365, 2, 41, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-27 09:46:06.000000', 366, 3, 41, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 367, 4, 41, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 368, 5, 41, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 369, 6, 41, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 370, 63, 42, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', null, '제품 관리부서'),
        (0, 1, 1, 3, null, 371, 62, 42, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 1, 1, 4, null, 372, 61, 42, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-03-18 19:15:07.000000', 373, 1, 42, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-18 19:15:07.000000', 374, 2, 42, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-18 19:15:07.000000', 375, 3, 42, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 376, 4, 42, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 377, 5, 42, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 378, 6, 42, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-04 00:39:33.000000', 379, 73, 43, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 3, null, 380, 72, 43, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 4, 1, 4, null, 381, 71, 43, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-08-02 00:39:33.000000', 382, 1, 43, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-02 00:39:33.000000', 383, 2, 43, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-02 00:39:33.000000', 384, 3, 43, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 385, 4, 43, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 386, 5, 43, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 387, 6, 43, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-02-05 23:33:26.000000', 388, 73, 44, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '반려합니디.', '고객 서비스부서'),
        (0, 5, 1, 3, null, 389, 72, 44, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 5, 1, 4, null, 390, 71, 44, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-02-03 23:33:26.000000', 391, 1, 44, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-03 23:33:26.000000', 392, 2, 44, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-03 23:33:26.000000', 393, 3, 44, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 394, 4, 44, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 395, 5, 44, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 396, 6, 44, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-05-26 22:29:12.000000', 397, 73, 45, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '결재 승인합니다.', '고객 서비스부서'),
        (1, 4, 1, 3, '2024-05-28 22:29:12.000000', 398, 72, 45, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 4, null, 399, 71, 45, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-05-26 22:29:12.000000', 400, 1, 45, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-26 22:29:12.000000', 401, 2, 45, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-26 22:29:12.000000', 402, 3, 45, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 403, 4, 45, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 404, 5, 45, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 405, 6, 45, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-30 19:46:19.000000', 406, 73, 46, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '결재 승인합니다.', '고객 서비스부서'),
        (2, 5, 1, 3, '2024-08-01 19:46:19.000000', 407, 72, 46, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', '반려합니디.', '고객 서비스부서'),
        (0, 5, 1, 4, null, 408, 71, 46, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-07-30 19:46:19.000000', 409, 1, 46, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-30 19:46:19.000000', 410, 2, 46, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-30 19:46:19.000000', 411, 3, 46, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 412, 4, 46, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 413, 5, 46, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 414, 6, 46, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-07 20:36:16.000000', 415, 73, 47, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '결재 승인합니다.', '고객 서비스부서'),
        (1, 4, 1, 3, '2024-02-09 20:36:16.000000', 416, 72, 47, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 4, null, 417, 71, 47, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-02-07 20:36:16.000000', 418, 1, 47, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-07 20:36:16.000000', 419, 2, 47, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-07 20:36:16.000000', 420, 3, 47, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 421, 4, 47, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 422, 5, 47, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 423, 6, 47, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-06-17 07:36:50.000000', 424, 73, 48, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '결재 승인합니다.', '고객 서비스부서'),
        (1, 4, 1, 3, '2024-06-19 07:36:50.000000', 425, 72, 48, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 4, null, 426, 71, 48, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-06-17 07:36:50.000000', 427, 1, 48, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-17 07:36:50.000000', 428, 2, 48, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-17 07:36:50.000000', 429, 3, 48, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 430, 4, 48, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 431, 5, 48, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 432, 6, 48, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-16 04:04:30.000000', 433, 83, 49, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '전결합니다.', '법무부서'),
        (0, 4, 1, 3, null, 434, 82, 49, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 4, 1, 4, null, 435, 81, 49, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-08-14 04:04:30.000000', 436, 1, 49, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-14 04:04:30.000000', 437, 2, 49, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-14 04:04:30.000000', 438, 3, 49, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 439, 4, 49, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 440, 5, 49, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 441, 6, 49, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-05-04 22:09:13.000000', 442, 83, 50, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '결재 승인합니다.', '법무부서'),
        (0, 1, 1, 3, null, 443, 82, 50, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 1, 1, 4, null, 444, 81, 50, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-05-04 22:09:13.000000', 445, 1, 50, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-04 22:09:13.000000', 446, 2, 50, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-04 22:09:13.000000', 447, 3, 50, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 448, 4, 50, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 449, 5, 50, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 450, 6, 50, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-16 15:40:15.000000', 451, 83, 51, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '전결합니다.', '법무부서'),
        (0, 4, 1, 3, null, 452, 82, 51, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 4, 1, 4, null, 453, 81, 51, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-08-14 15:40:15.000000', 454, 1, 51, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-14 15:40:15.000000', 455, 2, 51, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-14 15:40:15.000000', 456, 3, 51, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 457, 4, 51, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 458, 5, 51, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 459, 6, 51, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-04-17 11:09:05.000000', 460, 83, 52, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '결재 승인합니다.', '법무부서'),
        (1, 4, 1, 3, '2024-04-19 11:09:05.000000', 461, 82, 52, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', '전결합니다.', '법무부서'),
        (0, 4, 1, 4, null, 462, 81, 52, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-04-17 11:09:05.000000', 463, 1, 52, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-17 11:09:05.000000', 464, 2, 52, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-17 11:09:05.000000', 465, 3, 52, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 466, 4, 52, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 467, 5, 52, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 468, 6, 52, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-06-05 00:12:32.000000', 469, 83, 53, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '반려합니디.', '법무부서'),
        (0, 5, 1, 3, null, 470, 82, 53, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 5, 1, 4, null, 471, 81, 53, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-06-03 00:12:32.000000', 472, 1, 53, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-03 00:12:32.000000', 473, 2, 53, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-03 00:12:32.000000', 474, 3, 53, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 475, 4, 53, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 476, 5, 53, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 477, 6, 53, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-04-10 06:14:55.000000', 478, 83, 54, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '반려합니디.', '법무부서'),
        (0, 5, 1, 3, null, 479, 82, 54, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 5, 1, 4, null, 480, 81, 54, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-04-08 06:14:55.000000', 481, 1, 54, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-08 06:14:55.000000', 482, 2, 54, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-08 06:14:55.000000', 483, 3, 54, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 484, 4, 54, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 485, 5, 54, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 486, 6, 54, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-03-26 00:57:10.000000', 487, 93, 55, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '반려합니디.', '연구개발부서'),
        (0, 5, 1, 3, null, 488, 92, 55, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 5, 1, 4, null, 489, 91, 55, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-03-24 00:57:10.000000', 490, 1, 55, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-24 00:57:10.000000', 491, 2, 55, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-24 00:57:10.000000', 492, 3, 55, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 493, 4, 55, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 494, 5, 55, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 495, 6, 55, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 496, 93, 56, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', null, '연구개발부서'),
        (0, 1, 1, 3, null, 497, 92, 56, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 1, 1, 4, null, 498, 91, 56, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-05-21 05:52:47.000000', 499, 1, 56, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-21 05:52:47.000000', 500, 2, 56, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-21 05:52:47.000000', 501, 3, 56, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 502, 4, 56, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 503, 5, 56, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 504, 6, 56, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 505, 93, 57, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', null, '연구개발부서'),
        (0, 1, 1, 3, null, 506, 92, 57, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 1, 1, 4, null, 507, 91, 57, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-06-19 21:31:15.000000', 508, 1, 57, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-19 21:31:15.000000', 509, 2, 57, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-19 21:31:15.000000', 510, 3, 57, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 511, 4, 57, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 512, 5, 57, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 513, 6, 57, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-19 20:10:06.000000', 514, 93, 58, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '결재 승인합니다.', '연구개발부서'),
        (1, 1, 1, 3, '2024-07-19 20:10:06.000000', 515, 92, 58, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', '결재 승인합니다.', '연구개발부서'),
        (1, 4, 1, 4, '2024-07-21 20:10:06.000000', 516, 91, 58, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', '전결합니다.', '연구개발부서'),
        (1, 0, 2, 2, '2024-07-19 20:10:06.000000', 517, 1, 58, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-19 20:10:06.000000', 518, 2, 58, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-19 20:10:06.000000', 519, 3, 58, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 520, 4, 58, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 521, 5, 58, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 522, 6, 58, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-01-07 03:36:24.000000', 523, 93, 59, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '결재 승인합니다.', '연구개발부서'),
        (2, 5, 1, 3, '2024-01-09 03:36:24.000000', 524, 92, 59, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', '반려합니디.', '연구개발부서'),
        (0, 5, 1, 4, null, 525, 91, 59, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-01-07 03:36:24.000000', 526, 1, 59, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-07 03:36:24.000000', 527, 2, 59, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-07 03:36:24.000000', 528, 3, 59, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 529, 4, 59, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 530, 5, 59, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 531, 6, 59, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-05-16 15:11:35.000000', 532, 93, 60, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '결재 승인합니다.', '연구개발부서'),
        (0, 1, 1, 3, null, 533, 92, 60, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 1, 1, 4, null, 534, 91, 60, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-05-16 15:11:35.000000', 535, 1, 60, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-16 15:11:35.000000', 536, 2, 60, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-16 15:11:35.000000', 537, 3, 60, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 538, 4, 60, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 539, 5, 60, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 540, 6, 60, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 541, 3, 61, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', null, '기술부서'),
        (0, 1, 1, 3, null, 542, 2, 61, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 1, 1, 4, null, 543, 1, 61, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-05-13 15:53:06.000000', 544, 11, 61, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-05-13 15:53:06.000000', 545, 12, 61, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-05-13 15:53:06.000000', 546, 13, 61, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 547, 4, 61, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 548, 5, 61, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 549, 6, 61, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-02-03 09:07:05.000000', 550, 3, 62, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '전결합니다.', '기술부서'),
        (0, 4, 1, 3, null, 551, 2, 62, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 4, 1, 4, null, 552, 1, 62, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-02-01 09:07:05.000000', 553, 11, 62, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-02-01 09:07:05.000000', 554, 12, 62, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-02-01 09:07:05.000000', 555, 13, 62, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 556, 4, 62, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 557, 5, 62, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 558, 6, 62, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-01-09 07:58:56.000000', 559, 3, 63, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '반려합니디.', '기술부서'),
        (0, 5, 1, 3, null, 560, 2, 63, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 5, 1, 4, null, 561, 1, 63, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-01-07 07:58:56.000000', 562, 11, 63, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-01-07 07:58:56.000000', 563, 12, 63, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-01-07 07:58:56.000000', 564, 13, 63, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 565, 4, 63, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 566, 5, 63, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 567, 6, 63, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-06-25 06:33:03.000000', 568, 3, 64, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '전결합니다.', '기술부서'),
        (0, 4, 1, 3, null, 569, 2, 64, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 4, 1, 4, null, 570, 1, 64, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-06-23 06:33:03.000000', 571, 11, 64, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-06-23 06:33:03.000000', 572, 12, 64, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-06-23 06:33:03.000000', 573, 13, 64, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 574, 4, 64, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 575, 5, 64, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 576, 6, 64, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-09 03:35:23.000000', 577, 3, 65, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '결재 승인합니다.', '기술부서'),
        (1, 1, 1, 3, '2024-07-09 03:35:23.000000', 578, 2, 65, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '결재 승인합니다.', '기술부서'),
        (1, 1, 1, 4, '2024-07-09 03:35:23.000000', 579, 1, 65, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '결재 승인합니다.', '기술부서'),
        (1, 0, 2, 2, '2024-07-09 03:35:23.000000', 580, 11, 65, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-07-09 03:35:23.000000', 581, 12, 65, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-07-09 03:35:23.000000', 582, 13, 65, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 583, 4, 65, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 584, 5, 65, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 585, 6, 65, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 586, 3, 66, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', null, '기술부서'),
        (0, 1, 1, 3, null, 587, 2, 66, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', null, '기술부서'),
        (0, 1, 1, 4, null, 588, 1, 66, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', null, '기술부서'),
        (1, 0, 2, 2, '2024-08-08 20:09:25.000000', 589, 11, 66, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 3, '2024-08-08 20:09:25.000000', 590, 12, 66, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '협의 합니다.', '마케팅부서'),
        (1, 0, 2, 4, '2024-08-08 20:09:25.000000', 591, 13, 66, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '협의 합니다.', '마케팅부서'),
        (0, 0, 3, 2, null, 592, 4, 66, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 593, 5, 66, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 594, 6, 66, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 595, 13, 67, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', null, '마케팅부서'),
        (0, 1, 1, 3, null, 596, 12, 67, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 597, 11, 67, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-06-10 12:11:14.000000', 598, 1, 67, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-10 12:11:14.000000', 599, 2, 67, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-10 12:11:14.000000', 600, 3, 67, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 601, 4, 67, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 602, 5, 67, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 603, 6, 67, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-10 15:38:06.000000', 604, 13, 68, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '결재 승인합니다.', '마케팅부서'),
        (0, 1, 1, 3, null, 605, 12, 68, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 606, 11, 68, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-07-10 15:38:06.000000', 607, 1, 68, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-10 15:38:06.000000', 608, 2, 68, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-10 15:38:06.000000', 609, 3, 68, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 610, 4, 68, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 611, 5, 68, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 612, 6, 68, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 613, 13, 69, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', null, '마케팅부서'),
        (0, 1, 1, 3, null, 614, 12, 69, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 615, 11, 69, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-01-29 16:36:50.000000', 616, 1, 69, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-29 16:36:50.000000', 617, 2, 69, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-29 16:36:50.000000', 618, 3, 69, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 619, 4, 69, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 620, 5, 69, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 621, 6, 69, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-04-25 00:39:18.000000', 622, 13, 70, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '전결합니다.', '마케팅부서'),
        (0, 4, 1, 3, null, 623, 12, 70, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 4, 1, 4, null, 624, 11, 70, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-04-23 00:39:18.000000', 625, 1, 70, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-23 00:39:18.000000', 626, 2, 70, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-23 00:39:18.000000', 627, 3, 70, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 628, 4, 70, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 629, 5, 70, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 630, 6, 70, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 631, 13, 71, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', null, '마케팅부서'),
        (0, 1, 1, 3, null, 632, 12, 71, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', null, '마케팅부서'),
        (0, 1, 1, 4, null, 633, 11, 71, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-02-23 14:46:42.000000', 634, 1, 71, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-23 14:46:42.000000', 635, 2, 71, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-23 14:46:42.000000', 636, 3, 71, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 637, 4, 71, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 638, 5, 71, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 639, 6, 71, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-24 23:32:58.000000', 640, 13, 72, 'employee13@gw.com', '사원13', '010-1111-1112', '과장', '결재 승인합니다.', '마케팅부서'),
        (2, 5, 1, 3, '2024-03-26 23:32:58.000000', 641, 12, 72, 'employee12@gw.com', '사원12', '010-1111-1111', '차장', '반려합니디.', '마케팅부서'),
        (0, 5, 1, 4, null, 642, 11, 72, 'employee11@gw.com', '사원11', '010-1111-1110', '부장', null, '마케팅부서'),
        (1, 0, 2, 2, '2024-03-24 23:32:58.000000', 643, 1, 72, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-24 23:32:58.000000', 644, 2, 72, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-24 23:32:58.000000', 645, 3, 72, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 646, 4, 72, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 647, 5, 72, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 648, 6, 72, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-05-21 09:18:43.000000', 649, 23, 73, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 650, 22, 73, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 651, 21, 73, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-05-19 09:18:43.000000', 652, 1, 73, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-19 09:18:43.000000', 653, 2, 73, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-19 09:18:43.000000', 654, 3, 73, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 655, 4, 73, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 656, 5, 73, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 657, 6, 73, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-13 14:01:27.000000', 658, 23, 74, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '전결합니다.', '영업부서'),
        (0, 4, 1, 3, null, 659, 22, 74, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 4, 1, 4, null, 660, 21, 74, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-08-11 14:01:27.000000', 661, 1, 74, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-11 14:01:27.000000', 662, 2, 74, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-11 14:01:27.000000', 663, 3, 74, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 664, 4, 74, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 665, 5, 74, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 666, 6, 74, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-06-06 19:39:27.000000', 667, 23, 75, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '결재 승인합니다.', '영업부서'),
        (0, 1, 1, 3, null, 668, 22, 75, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 1, 1, 4, null, 669, 21, 75, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-06-06 19:39:27.000000', 670, 1, 75, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-06 19:39:27.000000', 671, 2, 75, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-06 19:39:27.000000', 672, 3, 75, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 673, 4, 75, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 674, 5, 75, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 675, 6, 75, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 676, 23, 76, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', null, '영업부서'),
        (0, 1, 1, 3, null, 677, 22, 76, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 1, 1, 4, null, 678, 21, 76, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-07-25 10:15:43.000000', 679, 1, 76, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-25 10:15:43.000000', 680, 2, 76, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-25 10:15:43.000000', 681, 3, 76, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 682, 4, 76, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 683, 5, 76, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 684, 6, 76, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-07-01 12:27:32.000000', 685, 23, 77, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', '반려합니디.', '영업부서'),
        (0, 5, 1, 3, null, 686, 22, 77, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 5, 1, 4, null, 687, 21, 77, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-06-29 12:27:32.000000', 688, 1, 77, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-29 12:27:32.000000', 689, 2, 77, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-29 12:27:32.000000', 690, 3, 77, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 691, 4, 77, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 692, 5, 77, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 693, 6, 77, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 694, 23, 78, 'employee23@gw.com', '사원23', '010-1111-1122', '과장', null, '영업부서'),
        (0, 1, 1, 3, null, 695, 22, 78, 'employee22@gw.com', '사원22', '010-1111-1121', '차장', null, '영업부서'),
        (0, 1, 1, 4, null, 696, 21, 78, 'employee21@gw.com', '사원21', '010-1111-1120', '부장', null, '영업부서'),
        (1, 0, 2, 2, '2024-02-26 15:01:02.000000', 697, 1, 78, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-26 15:01:02.000000', 698, 2, 78, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-26 15:01:02.000000', 699, 3, 78, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 700, 4, 78, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 701, 5, 78, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 702, 6, 78, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-07-07 11:32:18.000000', 703, 33, 79, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '결재 승인합니다.', '인사부서'),
        (1, 4, 1, 3, '2024-07-09 11:32:18.000000', 704, 32, 79, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', '전결합니다.', '인사부서'),
        (0, 4, 1, 4, null, 705, 31, 79, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-07-07 11:32:18.000000', 706, 1, 79, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-07 11:32:18.000000', 707, 2, 79, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-07 11:32:18.000000', 708, 3, 79, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 709, 4, 79, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 710, 5, 79, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 711, 6, 79, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-27 12:47:51.000000', 712, 33, 80, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '결재 승인합니다.', '인사부서'),
        (0, 1, 1, 3, null, 713, 32, 80, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 1, 1, 4, null, 714, 31, 80, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-03-27 12:47:51.000000', 715, 1, 80, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-27 12:47:51.000000', 716, 2, 80, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-27 12:47:51.000000', 717, 3, 80, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 718, 4, 80, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 719, 5, 80, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 720, 6, 80, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-04-09 01:59:17.000000', 721, 33, 81, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '반려합니디.', '인사부서'),
        (0, 5, 1, 3, null, 722, 32, 81, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 5, 1, 4, null, 723, 31, 81, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-04-07 01:59:17.000000', 724, 1, 81, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-07 01:59:17.000000', 725, 2, 81, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-07 01:59:17.000000', 726, 3, 81, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 727, 4, 81, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 728, 5, 81, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 729, 6, 81, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-07 17:02:50.000000', 730, 33, 82, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '결재 승인합니다.', '인사부서'),
        (0, 1, 1, 3, null, 731, 32, 82, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 1, 1, 4, null, 732, 31, 82, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-02-07 17:02:50.000000', 733, 1, 82, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-07 17:02:50.000000', 734, 2, 82, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-07 17:02:50.000000', 735, 3, 82, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 736, 4, 82, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 737, 5, 82, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 738, 6, 82, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-04 08:40:19.000000', 739, 33, 83, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', '결재 승인합니다.', '인사부서'),
        (1, 4, 1, 3, '2024-02-06 08:40:19.000000', 740, 32, 83, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', '전결합니다.', '인사부서'),
        (0, 4, 1, 4, null, 741, 31, 83, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-02-04 08:40:19.000000', 742, 1, 83, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-04 08:40:19.000000', 743, 2, 83, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-04 08:40:19.000000', 744, 3, 83, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 745, 4, 83, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 746, 5, 83, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 747, 6, 83, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 748, 33, 84, 'employee33@gw.com', '사원33', '010-1111-1132', '과장', null, '인사부서'),
        (0, 1, 1, 3, null, 749, 32, 84, 'employee32@gw.com', '사원32', '010-1111-1131', '차장', null, '인사부서'),
        (0, 1, 1, 4, null, 750, 31, 84, 'employee31@gw.com', '사원31', '010-1111-1130', '부장', null, '인사부서'),
        (1, 0, 2, 2, '2024-04-29 19:51:39.000000', 751, 1, 84, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-29 19:51:39.000000', 752, 2, 84, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-29 19:51:39.000000', 753, 3, 84, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 754, 4, 84, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 755, 5, 84, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 756, 6, 84, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-02-06 10:06:26.000000', 757, 43, 85, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '반려합니디.', '재무부서'),
        (0, 5, 1, 3, null, 758, 42, 85, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 5, 1, 4, null, 759, 41, 85, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-02-04 10:06:26.000000', 760, 1, 85, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-04 10:06:26.000000', 761, 2, 85, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-04 10:06:26.000000', 762, 3, 85, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 763, 4, 85, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 764, 5, 85, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 765, 6, 85, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-04-25 02:08:37.000000', 766, 43, 86, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '결재 승인합니다.', '재무부서'),
        (2, 5, 1, 3, '2024-04-27 02:08:37.000000', 767, 42, 86, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', '반려합니디.', '재무부서'),
        (0, 5, 1, 4, null, 768, 41, 86, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-04-25 02:08:37.000000', 769, 1, 86, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-25 02:08:37.000000', 770, 2, 86, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-25 02:08:37.000000', 771, 3, 86, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 772, 4, 86, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 773, 5, 86, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 774, 6, 86, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-01-23 06:21:53.000000', 775, 43, 87, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '반려합니디.', '재무부서'),
        (0, 5, 1, 3, null, 776, 42, 87, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 5, 1, 4, null, 777, 41, 87, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-01-21 06:21:53.000000', 778, 1, 87, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-21 06:21:53.000000', 779, 2, 87, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-21 06:21:53.000000', 780, 3, 87, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 781, 4, 87, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 782, 5, 87, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 783, 6, 87, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-08-15 14:30:43.000000', 784, 43, 88, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '전결합니다.', '재무부서'),
        (0, 4, 1, 3, null, 785, 42, 88, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 4, 1, 4, null, 786, 41, 88, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-08-13 14:30:43.000000', 787, 1, 88, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-13 14:30:43.000000', 788, 2, 88, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-13 14:30:43.000000', 789, 3, 88, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 790, 4, 88, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 791, 5, 88, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 792, 6, 88, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-03-03 05:59:14.000000', 793, 43, 89, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '전결합니다.', '재무부서'),
        (0, 4, 1, 3, null, 794, 42, 89, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 4, 1, 4, null, 795, 41, 89, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-03-01 05:59:14.000000', 796, 1, 89, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-01 05:59:14.000000', 797, 2, 89, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-01 05:59:14.000000', 798, 3, 89, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 799, 4, 89, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 800, 5, 89, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 801, 6, 89, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-01 07:29:45.000000', 802, 43, 90, 'employee43@gw.com', '사원43', '010-1111-1142', '과장', '결재 승인합니다.', '재무부서'),
        (0, 1, 1, 3, null, 803, 42, 90, 'employee42@gw.com', '사원42', '010-1111-1141', '차장', null, '재무부서'),
        (0, 1, 1, 4, null, 804, 41, 90, 'employee41@gw.com', '사원41', '010-1111-1140', '부장', null, '재무부서'),
        (1, 0, 2, 2, '2024-03-01 07:29:45.000000', 805, 1, 90, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-01 07:29:45.000000', 806, 2, 90, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-01 07:29:45.000000', 807, 3, 90, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 808, 4, 90, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 809, 5, 90, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 810, 6, 90, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-02-01 16:51:04.000000', 811, 53, 91, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '전결합니다.', 'IT 지원부서'),
        (0, 4, 1, 3, null, 812, 52, 91, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 4, 1, 4, null, 813, 51, 91, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-01-30 16:51:04.000000', 814, 1, 91, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-30 16:51:04.000000', 815, 2, 91, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-30 16:51:04.000000', 816, 3, 91, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 817, 4, 91, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 818, 5, 91, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 819, 6, 91, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-08 02:43:45.000000', 820, 53, 92, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '결재 승인합니다.', 'IT 지원부서'),
        (2, 5, 1, 3, '2024-03-10 02:43:45.000000', 821, 52, 92, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', '반려합니디.', 'IT 지원부서'),
        (0, 5, 1, 4, null, 822, 51, 92, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-03-08 02:43:45.000000', 823, 1, 92, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-08 02:43:45.000000', 824, 2, 92, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-08 02:43:45.000000', 825, 3, 92, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 826, 4, 92, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 827, 5, 92, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 828, 6, 92, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-05-09 10:30:19.000000', 829, 53, 93, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '결재 승인합니다.', 'IT 지원부서'),
        (1, 1, 1, 3, '2024-05-09 10:30:19.000000', 830, 52, 93, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', '결재 승인합니다.', 'IT 지원부서'),
        (1, 4, 1, 4, '2024-05-11 10:30:19.000000', 831, 51, 93, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', '전결합니다.', 'IT 지원부서'),
        (1, 0, 2, 2, '2024-05-09 10:30:19.000000', 832, 1, 93, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-09 10:30:19.000000', 833, 2, 93, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-09 10:30:19.000000', 834, 3, 93, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 835, 4, 93, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 836, 5, 93, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 837, 6, 93, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-01-10 01:42:51.000000', 838, 53, 94, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '결재 승인합니다.', 'IT 지원부서'),
        (1, 1, 1, 3, '2024-01-10 01:42:51.000000', 839, 52, 94, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', '결재 승인합니다.', 'IT 지원부서'),
        (1, 1, 1, 4, '2024-01-10 01:42:51.000000', 840, 51, 94, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', '결재 승인합니다.', 'IT 지원부서'),
        (1, 0, 2, 2, '2024-01-10 01:42:51.000000', 841, 1, 94, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-10 01:42:51.000000', 842, 2, 94, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-10 01:42:51.000000', 843, 3, 94, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 844, 4, 94, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 845, 5, 94, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 846, 6, 94, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 847, 53, 95, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', null, 'IT 지원부서'),
        (0, 1, 1, 3, null, 848, 52, 95, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 1, 1, 4, null, 849, 51, 95, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-04-29 19:38:02.000000', 850, 1, 95, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-29 19:38:02.000000', 851, 2, 95, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-29 19:38:02.000000', 852, 3, 95, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 853, 4, 95, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 854, 5, 95, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 855, 6, 95, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-04-16 07:57:22.000000', 856, 53, 96, 'employee53@gw.com', '사원53', '010-1111-1152', '과장', '전결합니다.', 'IT 지원부서'),
        (0, 4, 1, 3, null, 857, 52, 96, 'employee52@gw.com', '사원52', '010-1111-1151', '차장', null, 'IT 지원부서'),
        (0, 4, 1, 4, null, 858, 51, 96, 'employee51@gw.com', '사원51', '010-1111-1150', '부장', null, 'IT 지원부서'),
        (1, 0, 2, 2, '2024-04-14 07:57:22.000000', 859, 1, 96, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-14 07:57:22.000000', 860, 2, 96, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-14 07:57:22.000000', 861, 3, 96, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 862, 4, 96, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 863, 5, 96, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 864, 6, 96, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-04-26 00:54:27.000000', 865, 63, 97, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '결재 승인합니다.', '제품 관리부서'),
        (2, 5, 1, 3, '2024-04-28 00:54:27.000000', 866, 62, 97, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', '반려합니디.', '제품 관리부서'),
        (0, 5, 1, 4, null, 867, 61, 97, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-04-26 00:54:27.000000', 868, 1, 97, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-26 00:54:27.000000', 869, 2, 97, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-26 00:54:27.000000', 870, 3, 97, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 871, 4, 97, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 872, 5, 97, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 873, 6, 97, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 874, 63, 98, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', null, '제품 관리부서'),
        (0, 1, 1, 3, null, 875, 62, 98, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 1, 1, 4, null, 876, 61, 98, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-07-09 12:14:00.000000', 877, 1, 98, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-09 12:14:00.000000', 878, 2, 98, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-09 12:14:00.000000', 879, 3, 98, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 880, 4, 98, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 881, 5, 98, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 882, 6, 98, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-08-07 11:01:45.000000', 883, 63, 99, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '결재 승인합니다.', '제품 관리부서'),
        (1, 4, 1, 3, '2024-08-09 11:01:45.000000', 884, 62, 99, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', '전결합니다.', '제품 관리부서'),
        (0, 4, 1, 4, null, 885, 61, 99, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-08-07 11:01:45.000000', 886, 1, 99, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-07 11:01:45.000000', 887, 2, 99, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-07 11:01:45.000000', 888, 3, 99, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 889, 4, 99, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 890, 5, 99, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 891, 6, 99, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-03-27 06:37:50.000000', 892, 63, 100, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '전결합니다.', '제품 관리부서'),
        (0, 4, 1, 3, null, 893, 62, 100, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 4, 1, 4, null, 894, 61, 100, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-03-25 06:37:50.000000', 895, 1, 100, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-25 06:37:50.000000', 896, 2, 100, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-25 06:37:50.000000', 897, 3, 100, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 898, 4, 100, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 899, 5, 100, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 900, 6, 100, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-03-01 08:30:30.000000', 901, 63, 101, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '전결합니다.', '제품 관리부서'),
        (0, 4, 1, 3, null, 902, 62, 101, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 4, 1, 4, null, 903, 61, 101, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-02-28 08:30:30.000000', 904, 1, 101, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-28 08:30:30.000000', 905, 2, 101, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-28 08:30:30.000000', 906, 3, 101, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 907, 4, 101, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 908, 5, 101, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 909, 6, 101, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-07-10 23:57:59.000000', 910, 63, 102, 'employee63@gw.com', '사원63', '010-1111-1162', '과장', '전결합니다.', '제품 관리부서'),
        (0, 4, 1, 3, null, 911, 62, 102, 'employee62@gw.com', '사원62', '010-1111-1161', '차장', null, '제품 관리부서'),
        (0, 4, 1, 4, null, 912, 61, 102, 'employee61@gw.com', '사원61', '010-1111-1160', '부장', null, '제품 관리부서'),
        (1, 0, 2, 2, '2024-07-08 23:57:59.000000', 913, 1, 102, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-08 23:57:59.000000', 914, 2, 102, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-08 23:57:59.000000', 915, 3, 102, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 916, 4, 102, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 917, 5, 102, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 918, 6, 102, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-06-16 11:42:05.000000', 919, 73, 103, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '반려합니디.', '고객 서비스부서'),
        (0, 5, 1, 3, null, 920, 72, 103, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 5, 1, 4, null, 921, 71, 103, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-06-14 11:42:05.000000', 922, 1, 103, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-14 11:42:05.000000', 923, 2, 103, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-14 11:42:05.000000', 924, 3, 103, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 925, 4, 103, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 926, 5, 103, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 927, 6, 103, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-05-29 20:25:09.000000', 928, 73, 104, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 3, null, 929, 72, 104, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 4, 1, 4, null, 930, 71, 104, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-05-27 20:25:09.000000', 931, 1, 104, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-27 20:25:09.000000', 932, 2, 104, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-27 20:25:09.000000', 933, 3, 104, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 934, 4, 104, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 935, 5, 104, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 936, 6, 104, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-02-03 18:25:17.000000', 937, 73, 105, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '반려합니디.', '고객 서비스부서'),
        (0, 5, 1, 3, null, 938, 72, 105, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 5, 1, 4, null, 939, 71, 105, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-02-01 18:25:17.000000', 940, 1, 105, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-01 18:25:17.000000', 941, 2, 105, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-01 18:25:17.000000', 942, 3, 105, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 943, 4, 105, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 944, 5, 105, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 945, 6, 105, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-07-13 13:40:46.000000', 946, 73, 106, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 3, null, 947, 72, 106, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 4, 1, 4, null, 948, 71, 106, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-07-11 13:40:46.000000', 949, 1, 106, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-07-11 13:40:46.000000', 950, 2, 106, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-07-11 13:40:46.000000', 951, 3, 106, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 952, 4, 106, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 953, 5, 106, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 954, 6, 106, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 955, 73, 107, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', null, '고객 서비스부서'),
        (0, 1, 1, 3, null, 956, 72, 107, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 1, 1, 4, null, 957, 71, 107, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-01-07 22:00:04.000000', 958, 1, 107, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-07 22:00:04.000000', 959, 2, 107, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-07 22:00:04.000000', 960, 3, 107, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 961, 4, 107, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 962, 5, 107, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 963, 6, 107, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-02-21 20:16:57.000000', 964, 73, 108, 'employee73@gw.com', '사원73', '010-1111-1172', '과장', '전결합니다.', '고객 서비스부서'),
        (0, 4, 1, 3, null, 965, 72, 108, 'employee72@gw.com', '사원72', '010-1111-1171', '차장', null, '고객 서비스부서'),
        (0, 4, 1, 4, null, 966, 71, 108, 'employee71@gw.com', '사원71', '010-1111-1170', '부장', null, '고객 서비스부서'),
        (1, 0, 2, 2, '2024-02-19 20:16:57.000000', 967, 1, 108, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-19 20:16:57.000000', 968, 2, 108, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-19 20:16:57.000000', 969, 3, 108, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 970, 4, 108, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 971, 5, 108, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 972, 6, 108, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-08-07 02:25:02.000000', 973, 83, 109, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '반려합니디.', '법무부서'),
        (0, 5, 1, 3, null, 974, 82, 109, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 5, 1, 4, null, 975, 81, 109, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-08-05 02:25:02.000000', 976, 1, 109, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-05 02:25:02.000000', 977, 2, 109, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-05 02:25:02.000000', 978, 3, 109, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 979, 4, 109, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 980, 5, 109, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 981, 6, 109, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-21 18:16:56.000000', 982, 83, 110, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '결재 승인합니다.', '법무부서'),
        (1, 4, 1, 3, '2024-02-23 18:16:56.000000', 983, 82, 110, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', '전결합니다.', '법무부서'),
        (0, 4, 1, 4, null, 984, 81, 110, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-02-21 18:16:56.000000', 985, 1, 110, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-21 18:16:56.000000', 986, 2, 110, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-21 18:16:56.000000', 987, 3, 110, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 988, 4, 110, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 989, 5, 110, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 990, 6, 110, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-04-29 08:38:28.000000', 991, 83, 111, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '반려합니디.', '법무부서'),
        (0, 5, 1, 3, null, 992, 82, 111, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 5, 1, 4, null, 993, 81, 111, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-04-27 08:38:28.000000', 994, 1, 111, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-27 08:38:28.000000', 995, 2, 111, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-27 08:38:28.000000', 996, 3, 111, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 997, 4, 111, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 998, 5, 111, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 999, 6, 111, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (2, 5, 1, 2, '2024-04-05 01:38:30.000000', 1000, 83, 112, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '반려합니디.', '법무부서'),
        (0, 5, 1, 3, null, 1001, 82, 112, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 5, 1, 4, null, 1002, 81, 112, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-04-03 01:38:30.000000', 1003, 1, 112, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-04-03 01:38:30.000000', 1004, 2, 112, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-04-03 01:38:30.000000', 1005, 3, 112, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1006, 4, 112, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1007, 5, 112, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1008, 6, 112, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 1009, 83, 113, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', null, '법무부서'),
        (0, 1, 1, 3, null, 1010, 82, 113, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 1, 1, 4, null, 1011, 81, 113, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-01-15 17:46:11.000000', 1012, 1, 113, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-01-15 17:46:11.000000', 1013, 2, 113, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-01-15 17:46:11.000000', 1014, 3, 113, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1015, 4, 113, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1016, 5, 113, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1017, 6, 113, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-05-21 01:10:20.000000', 1018, 83, 114, 'employee83@gw.com', '사원83', '010-1111-1182', '과장', '전결합니다.', '법무부서'),
        (0, 4, 1, 3, null, 1019, 82, 114, 'employee82@gw.com', '사원82', '010-1111-1181', '차장', null, '법무부서'),
        (0, 4, 1, 4, null, 1020, 81, 114, 'employee81@gw.com', '사원81', '010-1111-1180', '부장', null, '법무부서'),
        (1, 0, 2, 2, '2024-05-19 01:10:20.000000', 1021, 1, 114, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-19 01:10:20.000000', 1022, 2, 114, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-19 01:10:20.000000', 1023, 3, 114, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1024, 4, 114, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1025, 5, 114, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1026, 6, 114, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-02-14 03:18:57.000000', 1027, 93, 115, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '결재 승인합니다.', '연구개발부서'),
        (1, 1, 1, 3, '2024-02-14 03:18:57.000000', 1028, 92, 115, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', '결재 승인합니다.', '연구개발부서'),
        (0, 1, 1, 4, null, 1029, 91, 115, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-02-14 03:18:57.000000', 1030, 1, 115, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-02-14 03:18:57.000000', 1031, 2, 115, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-02-14 03:18:57.000000', 1032, 3, 115, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1033, 4, 115, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1034, 5, 115, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1035, 6, 115, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 1036, 93, 116, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', null, '연구개발부서'),
        (0, 1, 1, 3, null, 1037, 92, 116, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 1, 1, 4, null, 1038, 91, 116, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-08-09 22:36:29.000000', 1039, 1, 116, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-08-09 22:36:29.000000', 1040, 2, 116, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-08-09 22:36:29.000000', 1041, 3, 116, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1042, 4, 116, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1043, 5, 116, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1044, 6, 116, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-05-31 20:53:30.000000', 1045, 93, 117, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '전결합니다.', '연구개발부서'),
        (0, 4, 1, 3, null, 1046, 92, 117, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 4, 1, 4, null, 1047, 91, 117, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-05-29 20:53:30.000000', 1048, 1, 117, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-05-29 20:53:30.000000', 1049, 2, 117, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-05-29 20:53:30.000000', 1050, 3, 117, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1051, 4, 117, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1052, 5, 117, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1053, 6, 117, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 1, 1, 2, '2024-03-28 23:02:02.000000', 1054, 93, 118, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '결재 승인합니다.', '연구개발부서'),
        (1, 4, 1, 3, '2024-03-30 23:02:02.000000', 1055, 92, 118, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', '전결합니다.', '연구개발부서'),
        (0, 4, 1, 4, null, 1056, 91, 118, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-03-28 23:02:02.000000', 1057, 1, 118, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-03-28 23:02:02.000000', 1058, 2, 118, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-03-28 23:02:02.000000', 1059, 3, 118, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1060, 4, 118, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1061, 5, 118, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1062, 6, 118, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (0, 1, 1, 2, null, 1063, 93, 119, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', null, '연구개발부서'),
        (0, 1, 1, 3, null, 1064, 92, 119, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 1, 1, 4, null, 1065, 91, 119, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-06-26 10:39:42.000000', 1066, 1, 119, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-26 10:39:42.000000', 1067, 2, 119, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-26 10:39:42.000000', 1068, 3, 119, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1069, 4, 119, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1070, 5, 119, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1071, 6, 119, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서'),
        (1, 4, 1, 2, '2024-06-20 14:26:54.000000', 1072, 93, 120, 'employee93@gw.com', '사원93', '010-1111-1192', '과장', '전결합니다.', '연구개발부서'),
        (0, 4, 1, 3, null, 1073, 92, 120, 'employee92@gw.com', '사원92', '010-1111-1191', '차장', null, '연구개발부서'),
        (0, 4, 1, 4, null, 1074, 91, 120, 'employee91@gw.com', '사원91', '010-1111-1190', '부장', null, '연구개발부서'),
        (1, 0, 2, 2, '2024-06-18 14:26:54.000000', 1075, 1, 120, 'employee1@gw.com', '사원1', '010-1111-1100', '부장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 3, '2024-06-18 14:26:54.000000', 1076, 2, 120, 'employee2@gw.com', '사원2', '010-1111-1101', '차장', '협의 합니다.', '기술부서'),
        (1, 0, 2, 4, '2024-06-18 14:26:54.000000', 1077, 3, 120, 'employee3@gw.com', '사원3', '010-1111-1102', '과장', '협의 합니다.', '기술부서'),
        (0, 0, 3, 2, null, 1078, 4, 120, 'employee4@gw.com', '사원4', '010-1111-1103', '과장', null, '기술부서'),
        (0, 0, 3, 3, null, 1079, 5, 120, 'employee5@gw.com', '사원5', '010-1111-1104', '대리', null, '기술부서'),
        (0, 0, 3, 4, null, 1080, 6, 120, 'employee6@gw.com', '사원6', '010-1111-1105', '대리', null, '기술부서');

/* ====== workflow end ======== */


/* ====== Material flow Start ======== */

insert into groupworks.materialflow_business (business_id, address, business_name, business_number, ceo, ceo_tel, fax, item, type)
values  (1, '서울특별시 강남구 테헤란로 123번지 45층', '중앙HTA', '123-45-67900', '최기리', '010-5678-1234', '02-1234-5678', 'IT 교육, 국비훈련', '교육 서비스업'),
        (2, '경기도 이천시 이천동 2000번지 2000-1', '◎◎제약™', '123-45-67890', '홍길동', '010-1234-1325', '031-123-1325', '유제품', '제조업'),
        (3, '서울특별시 강남구 테헤란로 123', '◇◇식품', '124-45-67891', '김영희', '010-5678-1325', '02-567-1325', '음료수', '식품업'),
        (4, '부산광역시 해운대구 우동 1234', '☆☆유통', '125-45-67892', '이철수', '010-8765-4321', '051-876-4321', '가전제품', '유통업'),
        (5, '대구광역시 달서구 상인동 987', '▲▲무역', '126-45-67893', '박영수', '010-4567-7890', '053-456-7890', '자동차 부품', '무역업'),
        (6, '울산광역시 남구 삼산동 456', '♤♤화학', '127-45-67894', '최지우', '010-2345-6789', '052-234-6789', '화학물질', '화학업'),
        (7, '전라북도 전주시 완산구 서노송동 789', '◆◆농산', '128-45-67895', '김민수', '010-3456-7891', '063-345-7891', '농산물', '농업'),
        (8, '경상남도 창원시 마산합포구 중앙동 123', '◇◇기계', '129-45-67896', '이성민', '010-4567-8912', '055-456-8912', '기계부품', '기계업'),
        (9, '경기도 수원시 팔달구 매산로 456', '○○전자', '130-45-67897', '박현준', '010-5678-9123', '031-567-9123', '전자제품', '전자업'),
        (10, '서울특별시 마포구 서교동 789', '△△의료', '131-45-67898', '최예진', '010-6789-1234', '02-678-1234', '의료기기', '의료업'),
        (11, '서울특별시 강남구 테헤란로 123번지 45층', '중앙HTA', '123-45-67900', '최기리', '010-5678-1234', '02-1234-5678', 'IT 교육, 국비훈련', '교육 서비스업'),
        (12, '대전광역시 중구 은행동 123', '▣▣섬유', '132-45-67899', '홍석현', '010-7891-2345', '042-789-2345', '섬유제품', '섬유업'),
        (13, '서울특별시 강남구 서초동 123-45', '삼성전자', '123-45-67890', '이재용', '010-1234-5678', '02-123-4567', '전자제품', '제조업'),
        (14, '서울특별시 영등포구 여의도동 234-56', 'LG화학', '124-45-67891', '신학철', '010-2345-6789', '02-234-5678', '화학물질', '화학업'),
        (15, '서울특별시 서초구 양재동 345-67', '현대자동차', '125-45-67892', '정의선', '010-3456-7890', '02-345-6789', '자동차', '제조업'),
        (16, '경기도 성남시 분당구 불정로 6', '네이버', '126-45-67893', '최수연', '010-4567-8901', '031-456-7890', '인터넷 서비스', '서비스업'),
        (17, '경기도 성남시 분당구 대왕판교로 645번길 16', '카카오', '127-45-67894', '홍은택', '010-5678-9012', '031-567-8901', '모바일 서비스', '정보통신업'),
        (18, '서울특별시 용산구 한강대로 100', '아모레퍼시픽', '128-45-67895', '서경배', '010-6789-0123', '02-678-9012', '화장품', '제조업'),
        (19, '서울특별시 강남구 테헤란로 152', '하이트진로', '129-45-67896', '김인규', '010-7890-1234', '02-789-0123', '음료', '제조업'),
        (20, '경기도 이천시 부발읍 경충대로 2091', 'SK하이닉스', '130-45-67897', '이석희', '010-8901-2345', '031-890-1234', '반도체', '제조업'),
        (21, '서울특별시 중구 동호로 330', 'CJ제일제당', '131-45-67898', '강신호', '010-9012-3456', '02-901-2345', '식품', '제조업'),
        (22, '서울특별시 강서구 하늘길 77', '대한항공', '132-45-67899', '우기홍', '010-0123-4567', '02-012-3456', '항공 서비스', '운송업'),
        (23, 'test test', '페이퍼컴퍼니', '000-00-00001', '나대표', '010-0000-0000', '00-000-000', '종이', '제조업')
        ;

insert into groupworks.material_business_manager (business_id, manager_id, email, name, phone)
values  (23, 1, 'manager01@test.com', '담당자1', '010-0000-0000'),
        (23, 2, 'manager02@test.com', '담당자2', '010-0000-0001'),
        (23, 3, 'manager03@test.com', '담당자3', '010-0000-0003'),
        (23, 4, 'manager04@test.com', '담당자4', '010-0000-0004'),
        (23, 5, 'manager05@test.com', '담당자5', '010-0000-0005'),
        (15, 6, 'momomo@hyundai.com', 'ㅁㅁㅁ', '010-0000-0001'),
        (8, 7, 'triagle@machine.com', '△△△', '010-0000-0001');

insert into groupworks.materialflow_order (delivery_date, due_date, order_date, zip_code, employee_id, manager_id, order_id, tex_amount, total_amount, address, address_detail, classification, order_code)
values  ('2024-08-14', '2024-08-29', '2024-08-07', '00112', 1, 2, 1, 10, 2000, '인천 부평구 무네미로 406 (구산동)', '3번 창고', '수주', '2024081412-0B3760541-I931'),
        ('2024-08-14', '2024-08-22', '2024-08-14', '00002', 1, 3, 2, 10, 17500, '부산 연제구 미남로 1 (거제동)', 'B-7구역', '발주', '2024081414-0A6653603-X773'),
        (null, '2024-09-30', '2024-08-20', '04352', 1, 1, 3, 10, 1135000, '서울 용산구 두텁바위로 2 (남영동)', '제3 출하장', '발주', '2024082014-0A8672909-A423'),
        (null, '2024-09-12', '2024-08-21', '04995', 51, 5, 5, 10, 55100000, '서울 광진구 군자동 48-15', '3층 페이퍼컴퍼니 사무실', '수주', '2024082015-0B9100950-U816'),
        (null, '2024-09-10', '2024-08-27', '08221', 1, 6, 6, 10, 112000000, '서울 구로구 안양천서자전거길 714 (고척동)', '△△상가 지하2층 주차장', '수주', '2024082015-0B2443520-QU02'),
        (null, '2024-09-10', '2024-08-27', '08221', 1, 6, 7, 10, 112000000, '서울 구로구 안양천서자전거길 714 (고척동)', '△△상가 지하2층 주차장', '수주', '2024082015-0B2443520-QU02'),
        (null, '2024-09-22', '2024-09-10', '16072', 21, 7, 8, 30, 2003000000, '경기 의왕시 맑은내길 34-4 (오전동)', '3층 창고', '발주', '2024082015-0A4584109-C0810');

insert into groupworks.materialflow_bom (status, bom_id, order_id, quantity, unit_price, item_code, item_name)
values  (true, 1, 1, 2, 1000, '0B3760541-I931-1', 'A4-200'),
        (false, 2, 2, 5, 980, '0A6653603-X773-1', 'A4-300'),
        (false, 3, 2, 3, 1200, '0A6653603-X773-2', 'A3-200'),
        (true, 4, 2, 3, 3000, '0A6653603-X773-3', 'B3-300'),
        (false, 5, 3, 5, 150000, '0A8672909-A423-1', '고급 가죽 노트'),
        (false, 6, 3, 3, 75000, '0A8672909-A423-2', '프리미엄 펜 세트'),
        (false, 7, 3, 2, 80000, '0A8672909-A423-3', '데스크 오거나이저 세트'),
        (false, 9, 5, 10, 1700000, '0B9100950-U816-1', '고성능 데스크톱 컴퓨터 (i7, RTX 4080, 32GB RAM, 1TB SSD)'),
        (false, 10, 5, 2, 2500000, '0B9100950-U816-2', '서버용 랙 (42U)'),
        (false, 11, 5, 3, 1200000, '0B9100950-U816-3', '사무용 복합기 (프린터/스캐너/복사기 통합)'),
        (false, 12, 5, 2, 500000, '0B9100950-U816-4', '레이저 프린터'),
        (false, 13, 5, 8, 3000000, '0B9100950-U816-5', 'CCTV 시스템 (8채널, 카메라 포함)'),
        (false, 14, 5, 3, 1500000, '0B9100950-U816-6', '회의실용 대형 모니터 (65인치)'),
        (false, 15, 6, 10, 10000000, '0B2443520-QU02-1', '전동 지게차'),
        (false, 16, 6, 4, 3000000, '0B2443520-QU02-2', '소형 트럭'),
        (false, 17, 7, 10, 10000000, '0B2443520-QU02-1', '전동 지게차'),
        (false, 18, 7, 4, 3000000, '0B2443520-QU02-2', '소형 트럭'),
        (false, 19, 8, 3, 130000000, '0A4584109-C0810-1', 'CNC 밀링 머신'),
        (false, 20, 8, 5, 84000000, '0A4584109-C0810-2', '유압프레스'),
        (false, 21, 8, 2, 168000000, '0A4584109-C0810-3', '로봇 용접기'),
        (false, 22, 8, 2, 105000000, '0A4584109-C0810-4', '선반 머신'),
        (false, 23, 8, 3, 56000000, '0A4584109-C0810-5', '기계식 펀칭 머신'),
        (false, 24, 8, 3, 21000000, '0A4584109-C0810-6', '배관 절단기'),
        (false, 25, 8, 5, 48000000, '0A4584109-C0810-7', '컨베이어 벨트 시스템'),
        (false, 26, 8, 5, 17000000, '0A4584109-C0810-8', '산업용 진공 포장기'),
        (false, 27, 8, 3, 7000000, '0A4584109-C0810-9', '제어 패널'),
        (false, 28, 8, 2, 35000000, '0A4584109-C0810-10', '냉각 시스템');

insert into groupworks.materialflow_item (delivery_time, storage_time, bom_id, item_id, delivery_manager, storage_manager, delivery_location, item_code, item_status, storage_location)
values  (null, '2024-08-15', 1, 1, '', 'B창고 관리자 ㅁㅁㅁ', '', '0B3760541-I931-115602', '입고', 'B창고'),
        (null, '2024-08-15', 1, 2, '', 'B창고 관리자 ㅁㅁㅁ', '', '0B3760541-I931-125603', '입고', 'B창고'),
        (null, null, 2, 3, null, null, null, '0A6653603-X773-113', null, null),
        (null, null, 2, 4, null, null, null, '0A6653603-X773-124', null, null),
        (null, null, 2, 5, null, null, null, '0A6653603-X773-135', null, null),
        (null, null, 2, 6, null, null, null, '0A6653603-X773-146', null, null),
        (null, null, 2, 7, null, null, null, '0A6653603-X773-157', null, null),
        (null, null, 3, 8, null, null, null, '0A6653603-X773-218', null, null),
        (null, null, 3, 9, null, null, null, '0A6653603-X773-229', null, null),
        (null, null, 3, 10, null, null, null, '0A6653603-X773-2310', null, null),
        ('2024-08-14', null, 4, 11, 'SS운송-ㅁㅁㅁ', '', 'B번 9출하장', '0A6653603-X773-3111', '출고', ''),
        ('2024-08-14', null, 4, 12, 'SS운송-ㅁㅁㅁ', '', 'B번 9출하장', '0A6653603-X773-3212', '출고', ''),
        ('2024-08-14', null, 4, 13, 'SS운송-ㅁㅁㅁ', '', 'B번 9출하장', '0A6653603-X773-3313', '출고', ''),
        (null, null, 5, 14, null, null, null, '0A8672909-A423-1114', null, null),
        (null, null, 5, 15, null, null, null, '0A8672909-A423-1215', null, null),
        (null, null, 5, 16, null, null, null, '0A8672909-A423-1316', null, null),
        (null, null, 5, 17, null, null, null, '0A8672909-A423-1417', null, null),
        (null, null, 5, 18, null, null, null, '0A8672909-A423-1518', null, null),
        (null, null, 6, 19, null, null, null, '0A8672909-A423-2119', null, null),
        (null, null, 6, 20, null, null, null, '0A8672909-A423-2220', null, null),
        (null, null, 6, 21, null, null, null, '0A8672909-A423-2321', null, null),
        (null, null, 7, 22, null, null, null, '0A8672909-A423-3122', null, null),
        (null, null, 7, 23, null, null, null, '0A8672909-A423-3223', null, null),
        (null, null, 9, 63, null, null, null, '0B9100950-U816-1163', null, null),
        (null, null, 9, 64, null, null, null, '0B9100950-U816-1264', null, null),
        (null, null, 9, 65, null, null, null, '0B9100950-U816-1365', null, null),
        (null, null, 9, 66, null, null, null, '0B9100950-U816-1466', null, null),
        (null, null, 9, 67, null, null, null, '0B9100950-U816-1567', null, null),
        (null, null, 9, 68, null, null, null, '0B9100950-U816-1668', null, null),
        (null, null, 9, 69, null, null, null, '0B9100950-U816-1769', null, null),
        (null, null, 9, 70, null, null, null, '0B9100950-U816-1870', null, null),
        (null, null, 9, 71, null, null, null, '0B9100950-U816-1971', null, null),
        (null, null, 9, 72, null, null, null, '0B9100950-U816-11072', null, null),
        (null, null, 10, 73, null, null, null, '0B9100950-U816-2173', null, null),
        (null, null, 10, 74, null, null, null, '0B9100950-U816-2274', null, null),
        (null, null, 11, 75, null, null, null, '0B9100950-U816-3175', null, null),
        (null, null, 11, 76, null, null, null, '0B9100950-U816-3276', null, null),
        (null, null, 11, 77, null, null, null, '0B9100950-U816-3377', null, null),
        (null, null, 12, 78, null, null, null, '0B9100950-U816-4178', null, null),
        (null, null, 12, 79, null, null, null, '0B9100950-U816-4279', null, null),
        (null, null, 13, 80, null, null, null, '0B9100950-U816-5180', null, null),
        (null, null, 13, 81, null, null, null, '0B9100950-U816-5281', null, null),
        (null, null, 13, 82, null, null, null, '0B9100950-U816-5382', null, null),
        (null, null, 13, 83, null, null, null, '0B9100950-U816-5483', null, null),
        (null, null, 13, 84, null, null, null, '0B9100950-U816-5584', null, null),
        (null, null, 13, 85, null, null, null, '0B9100950-U816-5685', null, null),
        (null, null, 13, 86, null, null, null, '0B9100950-U816-5786', null, null),
        (null, null, 13, 87, null, null, null, '0B9100950-U816-5887', null, null),
        (null, null, 14, 88, null, null, null, '0B9100950-U816-6188', null, null),
        (null, null, 14, 89, null, null, null, '0B9100950-U816-6289', null, null),
        (null, null, 14, 90, null, null, null, '0B9100950-U816-6390', null, null),
        (null, null, 15, 91, null, null, null, '0B2443520-QU02-1191', null, null),
        (null, null, 15, 92, null, null, null, '0B2443520-QU02-1292', null, null),
        (null, null, 15, 93, null, null, null, '0B2443520-QU02-1393', null, null),
        (null, null, 15, 94, null, null, null, '0B2443520-QU02-1494', null, null),
        (null, null, 15, 95, null, null, null, '0B2443520-QU02-1595', null, null),
        (null, null, 15, 96, null, null, null, '0B2443520-QU02-1696', null, null),
        (null, null, 15, 97, null, null, null, '0B2443520-QU02-1797', null, null),
        (null, null, 15, 98, null, null, null, '0B2443520-QU02-1898', null, null),
        (null, null, 15, 99, null, null, null, '0B2443520-QU02-1999', null, null),
        (null, null, 15, 100, null, null, null, '0B2443520-QU02-110100', null, null),
        (null, null, 16, 101, null, null, null, '0B2443520-QU02-21101', null, null),
        (null, null, 17, 102, null, null, null, '0B2443520-QU02-11102', null, null),
        (null, null, 16, 103, null, null, null, '0B2443520-QU02-22103', null, null),
        (null, null, 17, 104, null, null, null, '0B2443520-QU02-12104', null, null),
        (null, null, 16, 105, null, null, null, '0B2443520-QU02-23105', null, null),
        (null, null, 16, 106, null, null, null, '0B2443520-QU02-24106', null, null),
        (null, null, 17, 107, null, null, null, '0B2443520-QU02-13107', null, null),
        (null, null, 17, 108, null, null, null, '0B2443520-QU02-14108', null, null),
        (null, null, 17, 109, null, null, null, '0B2443520-QU02-15109', null, null),
        (null, null, 17, 110, null, null, null, '0B2443520-QU02-16110', null, null),
        (null, null, 17, 111, null, null, null, '0B2443520-QU02-17111', null, null),
        (null, null, 17, 112, null, null, null, '0B2443520-QU02-18112', null, null),
        (null, null, 17, 113, null, null, null, '0B2443520-QU02-19113', null, null),
        (null, null, 17, 114, null, null, null, '0B2443520-QU02-110114', null, null),
        (null, null, 18, 115, null, null, null, '0B2443520-QU02-21115', null, null),
        (null, null, 18, 116, null, null, null, '0B2443520-QU02-22116', null, null),
        (null, null, 18, 117, null, null, null, '0B2443520-QU02-23117', null, null),
        (null, null, 18, 118, null, null, null, '0B2443520-QU02-24118', null, null),
        (null, null, 19, 119, null, null, null, '0A4584109-C0810-11119', null, null),
        (null, null, 19, 120, null, null, null, '0A4584109-C0810-12120', null, null),
        (null, null, 19, 121, null, null, null, '0A4584109-C0810-13121', null, null),
        (null, null, 20, 122, null, null, null, '0A4584109-C0810-21122', null, null),
        (null, null, 20, 123, null, null, null, '0A4584109-C0810-22123', null, null),
        (null, null, 20, 124, null, null, null, '0A4584109-C0810-23124', null, null),
        (null, null, 20, 125, null, null, null, '0A4584109-C0810-24125', null, null),
        (null, null, 20, 126, null, null, null, '0A4584109-C0810-25126', null, null),
        (null, null, 21, 127, null, null, null, '0A4584109-C0810-31127', null, null),
        (null, null, 21, 128, null, null, null, '0A4584109-C0810-32128', null, null),
        (null, null, 22, 129, null, null, null, '0A4584109-C0810-41129', null, null),
        (null, null, 22, 130, null, null, null, '0A4584109-C0810-42130', null, null),
        (null, null, 23, 131, null, null, null, '0A4584109-C0810-51131', null, null),
        (null, null, 23, 132, null, null, null, '0A4584109-C0810-52132', null, null),
        (null, null, 23, 133, null, null, null, '0A4584109-C0810-53133', null, null),
        (null, null, 24, 134, null, null, null, '0A4584109-C0810-61134', null, null),
        (null, null, 24, 135, null, null, null, '0A4584109-C0810-62135', null, null),
        (null, null, 24, 136, null, null, null, '0A4584109-C0810-63136', null, null),
        (null, null, 25, 137, null, null, null, '0A4584109-C0810-71137', null, null),
        (null, null, 25, 138, null, null, null, '0A4584109-C0810-72138', null, null),
        (null, null, 25, 139, null, null, null, '0A4584109-C0810-73139', null, null),
        (null, null, 25, 140, null, null, null, '0A4584109-C0810-74140', null, null),
        (null, null, 25, 141, null, null, null, '0A4584109-C0810-75141', null, null),
        (null, null, 26, 142, null, null, null, '0A4584109-C0810-81142', null, null),
        (null, null, 26, 143, null, null, null, '0A4584109-C0810-82143', null, null),
        (null, null, 26, 144, null, null, null, '0A4584109-C0810-83144', null, null),
        (null, null, 26, 145, null, null, null, '0A4584109-C0810-84145', null, null),
        (null, null, 26, 146, null, null, null, '0A4584109-C0810-85146', null, null),
        (null, null, 27, 147, null, null, null, '0A4584109-C0810-91147', null, null),
        (null, null, 27, 148, null, null, null, '0A4584109-C0810-92148', null, null),
        (null, null, 27, 149, null, null, null, '0A4584109-C0810-93149', null, null),
        (null, null, 28, 150, null, null, null, '0A4584109-C0810-101150', null, null),
        (null, null, 28, 151, null, null, null, '0A4584109-C0810-102151', null, null);

insert into groupworks.materialflow_mes (bom_id, defects_num, manufacture_date, order_id, quantity, unit_price, item_code, item_name, process_location)
values  (1, 11, '2024-08-16 17:46:40.659212', 1, 100, 500, '0B3760541-I931-1', 'A4', '공장1 A4 제조 공정'),
        (27, 1, '2024-08-20 16:22:44.721408', 8, 3, 3500000, '0A4584109-C0810-9', '제어 패널', '디스플레이 공장'),
        (28, 1, '2024-08-20 16:27:10.752490', 8, 2, 28000000, '0A4584109-C0810-10', '냉각 시스템', '냉동기계 제조공장'),
        (23, 0, '2024-08-20 16:28:38.658881', 8, 3, 36000000, '0A4584109-C0810-5', '기계식 펀칭 머신', '자동기계 제조공장');

/* ====== Material flow End ======== */


-- 1~10
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-01 10:00:00', 5, '2025-03-01 10:00:00', 'Vacation', '휴가 1', '2025-09-01', '2025-03-02', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-02 10:00:00', 7, '2025-03-02 10:00:00', 'Vacation', '휴가 2', '2025-09-04', '2025-03-03', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-03 10:00:00', 1, '2025-03-03 10:00:00', 'Vacation', '휴가 3', '2025-09-07', '2025-03-04', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-04 10:00:00', 3, '2025-03-04 10:00:00', 'Vacation', '휴가 4', '2025-09-10', '2025-03-05', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-05 10:00:00', 9, '2025-03-05 10:00:00', 'Vacation', '휴가 5', '2025-09-13', '2025-03-06', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-06 10:00:00', 4, '2025-03-06 10:00:00', 'Vacation', '휴가 6', '2025-09-16', '2025-03-07', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-07 10:00:00', 6, '2025-03-07 10:00:00', 'Vacation', '휴가 7', '2025-09-19', '2025-03-08', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-08 10:00:00', 10, '2025-03-08 10:00:00', 'Vacation', '휴가 8', '2025-09-22', '2025-03-09', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-09 10:00:00', 8, '2025-03-09 10:00:00', 'Vacation', '휴가 9', '2025-09-25', '2025-03-10', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-10 10:00:00', 2, '2025-03-10 10:00:00', 'Vacation', '휴가 10', '2025-09-28', '2025-03-11', '💼 기타');

-- 11~20
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-11 10:00:00', 5, '2025-03-11 10:00:00', 'Vacation', '휴가 11', '2025-09-30', '2025-03-12', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-12 10:00:00', 7, '2025-03-12 10:00:00', 'Vacation', '휴가 12', '2025-10-03', '2025-03-13', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-13 10:00:00', 1, '2025-03-13 10:00:00', 'Vacation', '휴가 13', '2025-10-06', '2025-03-14', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-14 10:00:00', 3, '2025-03-14 10:00:00', 'Vacation', '휴가 14', '2025-10-09', '2025-03-15', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-15 10:00:00', 9, '2025-03-15 10:00:00', 'Vacation', '휴가 15', '2025-10-12', '2025-03-16', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-16 10:00:00', 4, '2025-03-16 10:00:00', 'Vacation', '휴가 16', '2025-10-15', '2025-03-17', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-17 10:00:00', 6, '2025-03-17 10:00:00', 'Vacation', '휴가 17', '2025-10-18', '2025-03-18', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-18 10:00:00', 10, '2025-03-18 10:00:00', 'Vacation', '휴가 18', '2025-10-21', '2025-03-19', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-19 10:00:00', 8, '2025-03-19 10:00:00', 'Vacation', '휴가 19', '2025-10-24', '2025-03-20', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-20 10:00:00', 2, '2025-03-20 10:00:00', 'Vacation', '휴가 20', '2025-10-27', '2025-03-21', '🕒 반차');

-- 21~30
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-21 10:00:00', 5, '2025-03-21 10:00:00', 'Vacation', '휴가 21', '2025-10-30', '2025-03-22', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-22 10:00:00', 7, '2025-03-22 10:00:00', 'Vacation', '휴가 22', '2025-11-02', '2025-03-23', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-23 10:00:00', 1, '2025-03-23 10:00:00', 'Vacation', '휴가 23', '2025-11-05', '2025-03-24', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-24 10:00:00', 3, '2025-03-24 10:00:00', 'Vacation', '휴가 24', '2025-11-08', '2025-03-25', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-25 10:00:00', 9, '2025-03-25 10:00:00', 'Vacation', '휴가 25', '2025-11-11', '2025-03-26', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-26 10:00:00', 4, '2025-03-26 10:00:00', 'Vacation', '휴가 26', '2025-11-14', '2025-03-27', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-27 10:00:00', 6, '2025-03-27 10:00:00', 'Vacation', '휴가 27', '2025-11-17', '2025-03-28', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-28 10:00:00', 10, '2025-03-28 10:00:00', 'Vacation', '휴가 28', '2025-11-20', '2025-03-29', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-29 10:00:00', 8, '2025-03-29 10:00:00', 'Vacation', '휴가 29', '2025-11-23', '2025-03-30', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-30 10:00:00', 2, '2025-03-30 10:00:00', 'Vacation', '휴가 30', '2025-11-26', '2025-03-31', '💼 기타');

-- 31~40
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-03-31 10:00:00', 5, '2025-03-31 10:00:00', 'Vacation', '휴가 31', '2025-11-29', '2025-04-01', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-01 10:00:00', 7, '2025-04-01 10:00:00', 'Vacation', '휴가 32', '2025-12-02', '2025-04-02', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-02 10:00:00', 1, '2025-04-02 10:00:00', 'Vacation', '휴가 33', '2025-12-05', '2025-04-03', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-03 10:00:00', 3, '2025-04-03 10:00:00', 'Vacation', '휴가 34', '2025-12-08', '2025-04-04', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-04 10:00:00', 9, '2025-04-04 10:00:00', 'Vacation', '휴가 35', '2025-12-11', '2025-04-05', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-05 10:00:00', 4, '2025-04-05 10:00:00', 'Vacation', '휴가 36', '2025-12-14', '2025-04-06', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-06 10:00:00', 6, '2025-04-06 10:00:00', 'Vacation', '휴가 37', '2025-12-17', '2025-04-07', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-07 10:00:00', 10, '2025-04-07 10:00:00', 'Vacation', '휴가 38', '2025-12-20', '2025-04-08', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-08 10:00:00', 8, '2025-04-08 10:00:00', 'Vacation', '휴가 39', '2025-12-23', '2025-04-09', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-09 10:00:00', 2, '2025-04-09 10:00:00', 'Vacation', '휴가 40', '2025-12-26', '2025-04-10', '🕒 반차');

-- 41~50
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-10 10:00:00', 5, '2025-04-10 10:00:00', 'Vacation', '휴가 41', '2025-12-29', '2025-04-11', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-11 10:00:00', 7, '2025-04-11 10:00:00', 'Vacation', '휴가 42', '2026-01-01', '2025-04-12', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-12 10:00:00', 1, '2025-04-12 10:00:00', 'Vacation', '휴가 43', '2026-01-04', '2025-04-13', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-13 10:00:00', 3, '2025-04-13 10:00:00', 'Vacation', '휴가 44', '2026-01-07', '2025-04-14', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-14 10:00:00', 9, '2025-04-14 10:00:00', 'Vacation', '휴가 45', '2026-01-10', '2025-04-15', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-15 10:00:00', 4, '2025-04-15 10:00:00', 'Vacation', '휴가 46', '2026-01-13', '2025-04-16', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-16 10:00:00', 6, '2025-04-16 10:00:00', 'Vacation', '휴가 47', '2026-01-16', '2025-04-17', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-17 10:00:00', 10, '2025-04-17 10:00:00', 'Vacation', '휴가 48', '2026-01-19', '2025-04-18', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-18 10:00:00', 8, '2025-04-18 10:00:00', 'Vacation', '휴가 49', '2026-01-22', '2025-04-19', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-19 10:00:00', 2, '2025-04-19 10:00:00', 'Vacation', '휴가 50', '2026-01-25', '2025-04-20', '💼 기타');

-- 51~60
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-20 10:00:00', 5, '2025-04-20 10:00:00', 'Vacation', '휴가 51', '2026-01-28', '2025-04-21', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-21 10:00:00', 7, '2025-04-21 10:00:00', 'Vacation', '휴가 52', '2026-01-31', '2025-04-22', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-22 10:00:00', 1, '2025-04-22 10:00:00', 'Vacation', '휴가 53', '2026-02-03', '2025-04-23', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-23 10:00:00', 3, '2025-04-23 10:00:00', 'Vacation', '휴가 54', '2026-02-06', '2025-04-24', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-24 10:00:00', 9, '2025-04-24 10:00:00', 'Vacation', '휴가 55', '2026-02-09', '2025-04-25', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-25 10:00:00', 4, '2025-04-25 10:00:00', 'Vacation', '휴가 56', '2026-02-12', '2025-04-26', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-26 10:00:00', 6, '2025-04-26 10:00:00', 'Vacation', '휴가 57', '2026-02-15', '2025-04-27', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-27 10:00:00', 10, '2025-04-27 10:00:00', 'Vacation', '휴가 58', '2026-02-18', '2025-04-28', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-28 10:00:00', 8, '2025-04-28 10:00:00', 'Vacation', '휴가 59', '2026-02-21', '2025-04-29', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-29 10:00:00', 2, '2025-04-29 10:00:00', 'Vacation', '휴가 60', '2026-02-24', '2025-04-30', '🕒 반차');

-- 61~70
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-04-30 10:00:00', 5, '2025-04-30 10:00:00', 'Vacation', '휴가 61', '2026-02-27', '2025-05-01', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-01 10:00:00', 7, '2025-05-01 10:00:00', 'Vacation', '휴가 62', '2026-03-01', '2025-05-02', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-02 10:00:00', 1, '2025-05-02 10:00:00', 'Vacation', '휴가 63', '2026-03-04', '2025-05-03', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-03 10:00:00', 3, '2025-05-03 10:00:00', 'Vacation', '휴가 64', '2026-03-07', '2025-05-04', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-04 10:00:00', 9, '2025-05-04 10:00:00', 'Vacation', '휴가 65', '2026-03-10', '2025-05-05', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-05 10:00:00', 4, '2025-05-05 10:00:00', 'Vacation', '휴가 66', '2026-03-13', '2025-05-06', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-06 10:00:00', 6, '2025-05-06 10:00:00', 'Vacation', '휴가 67', '2026-03-16', '2025-05-07', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-07 10:00:00', 10, '2025-05-07 10:00:00', 'Vacation', '휴가 68', '2026-03-19', '2025-05-08', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-08 10:00:00', 8, '2025-05-08 10:00:00', 'Vacation', '휴가 69', '2026-03-22', '2025-05-09', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-09 10:00:00', 2, '2025-05-09 10:00:00', 'Vacation', '휴가 70', '2026-03-25', '2025-05-10', '💼 기타');

-- 71~80
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-10 10:00:00', 5, '2025-05-10 10:00:00', 'Vacation', '휴가 71', '2026-03-28', '2025-05-11', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-11 10:00:00', 7, '2025-05-11 10:00:00', 'Vacation', '휴가 72', '2026-04-01', '2025-05-12', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-12 10:00:00', 1, '2025-05-12 10:00:00', 'Vacation', '휴가 73', '2026-04-04', '2025-05-13', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-13 10:00:00', 3, '2025-05-13 10:00:00', 'Vacation', '휴가 74', '2026-04-07', '2025-05-14', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-14 10:00:00', 9, '2025-05-14 10:00:00', 'Vacation', '휴가 75', '2026-04-10', '2025-05-15', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-15 10:00:00', 4, '2025-05-15 10:00:00', 'Vacation', '휴가 76', '2026-04-13', '2025-05-16', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-16 10:00:00', 6, '2025-05-16 10:00:00', 'Vacation', '휴가 77', '2026-04-16', '2025-05-17', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-17 10:00:00', 10, '2025-05-17 10:00:00', 'Vacation', '휴가 78', '2026-04-19', '2025-05-18', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-18 10:00:00', 8, '2025-05-18 10:00:00', 'Vacation', '휴가 79', '2026-04-22', '2025-05-19', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-19 10:00:00', 2, '2025-05-19 10:00:00', 'Vacation', '휴가 80', '2026-04-25', '2025-05-20', '🕒 반차');

-- 81~90
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-20 10:00:00', 5, '2025-05-20 10:00:00', 'Vacation', '휴가 81', '2026-04-28', '2025-05-21', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-21 10:00:00', 7, '2025-05-21 10:00:00', 'Vacation', '휴가 82', '2026-05-01', '2025-05-22', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-22 10:00:00', 1, '2025-05-22 10:00:00', 'Vacation', '휴가 83', '2026-05-04', '2025-05-23', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-23 10:00:00', 3, '2025-05-23 10:00:00', 'Vacation', '휴가 84', '2026-05-07', '2025-05-24', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-24 10:00:00', 9, '2025-05-24 10:00:00', 'Vacation', '휴가 85', '2026-05-10', '2025-05-25', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-25 10:00:00', 4, '2025-05-25 10:00:00', 'Vacation', '휴가 86', '2026-05-13', '2025-05-26', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-26 10:00:00', 6, '2025-05-26 10:00:00', 'Vacation', '휴가 87', '2026-05-16', '2025-05-27', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-27 10:00:00', 10, '2025-05-27 10:00:00', 'Vacation', '휴가 88', '2026-05-19', '2025-05-28', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-28 10:00:00', 8, '2025-05-28 10:00:00', 'Vacation', '휴가 89', '2026-05-22', '2025-05-29', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-29 10:00:00', 2, '2025-05-29 10:00:00', 'Vacation', '휴가 90', '2026-05-25', '2025-05-30', '💼 기타');

-- 91~100
INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-30 10:00:00', 5, '2025-05-30 10:00:00', 'Vacation', '휴가 91', '2026-05-28', '2025-05-31', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-05-31 10:00:00', 7, '2025-05-31 10:00:00', 'Vacation', '휴가 92', '2026-06-01', '2025-06-01', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-01 10:00:00', 1, '2025-06-01 10:00:00', 'Vacation', '휴가 93', '2026-06-04', '2025-06-02', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-02 10:00:00', 3, '2025-06-02 10:00:00', 'Vacation', '휴가 94', '2026-06-07', '2025-06-03', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-03 10:00:00', 9, '2025-06-03 10:00:00', 'Vacation', '휴가 95', '2026-06-10', '2025-06-04', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-04 10:00:00', 4, '2025-06-04 10:00:00', 'Vacation', '휴가 96', '2026-06-13', '2025-06-05', '🕒 반차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-05 10:00:00', 6, '2025-06-05 10:00:00', 'Vacation', '휴가 97', '2026-06-16', '2025-06-06', '💊 병가');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-06 10:00:00', 10, '2025-06-06 10:00:00', 'Vacation', '휴가 98', '2026-06-19', '2025-06-07', '💼 기타');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-07 10:00:00', 8, '2025-06-07 10:00:00', 'Vacation', '휴가 99', '2026-06-22', '2025-06-08', '🌴 연차');

INSERT INTO groupworks.calendar (created_date, employee_id, last_modified_date, dtype, contents, end_date, start_date, title)
VALUES ('2025-06-08 10:00:00', 2, '2025-06-08 10:00:00', 'Vacation', '휴가 100', '2026-06-25', '2025-06-09', '🕒 반차');





INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 1, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 2, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 3, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 4, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 5, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 6, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 7, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 8, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 9, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 10, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 11, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 12, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 13, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 14, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 15, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 16, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 17, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 18, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 19, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 20, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 21, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 22, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 23, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 24, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 25, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 26, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 27, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 28, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 29, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 30, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 31, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 32, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 33, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 34, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 35, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 36, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 37, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 38, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 39, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 40, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 41, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 42, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 43, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 44, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 45, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 46, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 47, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 48, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 49, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 50, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 51, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 52, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 53, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 54, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 55, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 56, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 57, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 58, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 59, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 60, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 61, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 62, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 63, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 64, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 65, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 66, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 67, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 68, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 69, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 70, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 71, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 72, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 73, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 74, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 75, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 76, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 77, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 78, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 79, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 80, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 81, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 82, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 83, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 84, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 85, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 86, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 87, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 88, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 89, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 90, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 91, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 92, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 93, NULL, NULL, 'AM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 94, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 95, NULL, NULL, NULL, 'PENDING', 'OTHER');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 96, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (0.5, 97, NULL, NULL, 'PM', 'PENDING', 'HALF');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (2, 98, NULL, NULL, NULL, 'PENDING', 'ANNUAL');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (1, 99, NULL, NULL, NULL, 'PENDING', 'SICK');
INSERT INTO groupworks.vacation (used_vacation, calendar_id, approver_id, approver_name, am_pm, status, vacation_type) VALUES (3, 100, NULL, NULL, NULL, 'PENDING', 'OTHER');

INSERT INTO board (create_date, department_id, employee_id, update_date, content, ip_address, subject, title, board_type) VALUES
    (DATE_SUB(NOW(), INTERVAL 600 MINUTE), 2, 1, NULL, '팀 성과 분석 결과', '127.0.0.1', 'general', '팀 성과 분석 결과 보고서 200', 'NOTICE'),
    (DATE_SUB(NOW(), INTERVAL 595 MINUTE), 2, 2, NULL, '업무 자동화 진행 상황', '127.0.0.1', 'mandatory', '업무 자동화 진행 상황 보고서 199', 'NOTICE'),
    (DATE_SUB(NOW(), INTERVAL 591 MINUTE), 2, 3, NULL, '부서 KPI 분석 보고서', '127.0.0.1', 'announcement', '부서 KPI 분석 보고서 198', 'NOTICE'),
    (DATE_SUB(NOW(), INTERVAL 587 MINUTE), 2, 4, NULL, '정기 점검 공지', '127.0.0.1', 'error', '정기 점검 공지 197', 'NOTICE'),
    (DATE_SUB(NOW(), INTERVAL 582 MINUTE), 2, 5, NULL, '업무 점검 공지', '127.0.0.1', 'inquiry', '업무 점검 공지 196', 'NOTICE'),
    (DATE_SUB(NOW(), INTERVAL 577 MINUTE), 2, 6, NULL, '시스템 개선 요청서', '127.0.0.1', 'general', '시스템 개선 요청서 195', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 573 MINUTE), 2, 7, NULL, '정기 검토 결과 보고서', '127.0.0.1', 'mandatory', '정기 검토 결과 보고서 194', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 568 MINUTE), 2, 1, NULL, '부서 성과 분석 보고서', '127.0.0.1', 'announcement', '부서 성과 분석 보고서 193', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 563 MINUTE), 2, 2, NULL, '업무 프로세스 개선 요청서', '127.0.0.1', 'error', '업무 프로세스 개선 요청서 192', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 558 MINUTE), 2, 3, NULL, '팀 성과 분석 보고서', '127.0.0.1', 'inquiry', '팀 성과 분석 보고서 191', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 553 MINUTE), 2, 4, NULL, '부서 KPI 보고서', '127.0.0.1', 'general', '부서 KPI 보고서 190', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 548 MINUTE), 2, 5, NULL, '업무 프로세스 개선', '127.0.0.1', 'mandatory', '업무 프로세스 개선 189', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 543 MINUTE), 2, 6, NULL, '시스템 점검 안내', '127.0.0.1', 'announcement', '시스템 점검 안내 188', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 538 MINUTE), 2, 7, NULL, '정기 검토 결과', '127.0.0.1', 'error', '정기 검토 결과 187', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 533 MINUTE), 2, 1, NULL, '팀 성과 분석', '127.0.0.1', 'inquiry', '팀 성과 분석 186', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 528 MINUTE), 2, 2, NULL, '업무 점검', '127.0.0.1', 'general', '업무 점검 185', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 523 MINUTE), 2, 3, NULL, '부서 성과 보고서', '127.0.0.1', 'mandatory', '부서 성과 보고서 184', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 518 MINUTE), 2, 4, NULL, '시스템 개선 계획', '127.0.0.1', 'announcement', '시스템 개선 계획 183', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 513 MINUTE), 2, 5, NULL, '정기 검토 계획', '127.0.0.1', 'error', '정기 검토 계획 182', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 508 MINUTE), 2, 6, NULL, '업무 프로세스 검토', '127.0.0.1', 'inquiry', '업무 프로세스 검토 181', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 503 MINUTE), 2, 7, NULL, '부서 KPI 분석', '127.0.0.1', 'general', '부서 KPI 분석 180', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 498 MINUTE), 2, 1, NULL, '정기 검토 결과 보고서', '127.0.0.1', 'mandatory', '정기 검토 결과 보고서 179', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 493 MINUTE), 2, 2, NULL, '시스템 개선 요청', '127.0.0.1', 'announcement', '시스템 개선 요청 178', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 488 MINUTE), 2, 3, NULL, '팀 성과 보고서', '127.0.0.1', 'error', '팀 성과 보고서 177', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 483 MINUTE), 2, 4, NULL, '업무 점검 공지', '127.0.0.1', 'inquiry', '업무 점검 공지 176', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 478 MINUTE), 2, 5, NULL, '부서 KPI 보고서', '127.0.0.1', 'general', '부서 KPI 보고서 175', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 473 MINUTE), 2, 6, NULL, '업무 개선 계획', '127.0.0.1', 'mandatory', '업무 개선 계획 174', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 468 MINUTE), 2, 7, NULL, '정기 검토 결과', '127.0.0.1', 'announcement', '정기 검토 결과 173', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 463 MINUTE), 2, 1, NULL, '부서 성과 분석', '127.0.0.1', 'error', '부서 성과 분석 172', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 458 MINUTE), 2, 2, NULL, '시스템 개선 보고서', '127.0.0.1', 'inquiry', '시스템 개선 보고서 171', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 453 MINUTE), 2, 3, NULL, '팀 성과 분석', '127.0.0.1', 'general', '팀 성과 분석 170', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 448 MINUTE), 2, 4, NULL, '업무 개선 보고서', '127.0.0.1', 'mandatory', '업무 개선 보고서 169', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 443 MINUTE), 2, 5, NULL, '부서 점검 결과', '127.0.0.1', 'announcement', '부서 점검 결과 168', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 438 MINUTE), 2, 6, NULL, '정기 검토 결과', '127.0.0.1', 'error', '정기 검토 결과 167', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 433 MINUTE), 2, 7, NULL, '업무 프로세스 분석', '127.0.0.1', 'inquiry', '업무 프로세스 분석 166', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 428 MINUTE), 2, 1, NULL, '팀 성과 리뷰', '127.0.0.1', 'general', '팀 성과 리뷰 165', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 423 MINUTE), 2, 2, NULL, '업무 프로세스 개선', '127.0.0.1', 'mandatory', '업무 프로세스 개선 164', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 418 MINUTE), 2, 3, NULL, '시스템 개선 결과', '127.0.0.1', 'announcement', '시스템 개선 결과 163', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 413 MINUTE), 2, 4, NULL, '부서 성과 리뷰', '127.0.0.1', 'error', '부서 성과 리뷰 162', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 408 MINUTE), 2, 5, NULL, '정기 점검 공지', '127.0.0.1', 'inquiry', '정기 점검 공지 161', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 403 MINUTE), 2, 6, NULL, '업무 점검 결과', '127.0.0.1', 'general', '업무 점검 결과 160', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 398 MINUTE), 2, 7, NULL, '부서 개선 보고서', '127.0.0.1', 'mandatory', '부서 개선 보고서 159', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 393 MINUTE), 2, 1, NULL, '팀 성과 분석 결과', '127.0.0.1', 'announcement', '팀 성과 분석 결과 158', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 388 MINUTE), 2, 2, NULL, '시스템 점검 계획', '127.0.0.1', 'error', '시스템 점검 계획 157', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 383 MINUTE), 2, 3, NULL, '정기 검토 계획', '127.0.0.1', 'inquiry', '정기 검토 계획 156', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 378 MINUTE), 2, 4, NULL, '업무 개선 계획', '127.0.0.1', 'general', '업무 개선 계획 155', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 373 MINUTE), 2, 5, NULL, '부서 KPI 분석 결과', '127.0.0.1', 'mandatory', '부서 KPI 분석 결과 154', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 368 MINUTE), 2, 6, NULL, '팀 성과 분석 보고서', '127.0.0.1', 'announcement', '팀 성과 분석 보고서 153', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 363 MINUTE), 2, 7, NULL, '시스템 개선 계획', '127.0.0.1', 'error', '시스템 개선 계획 152', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 358 MINUTE), 2, 1, NULL, '정기 검토 결과', '127.0.0.1', 'inquiry', '정기 검토 결과 151', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 353 MINUTE), 2, 2, NULL, '부서 성과 보고서', '127.0.0.1', 'general', '부서 성과 보고서 150', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 348 MINUTE), 2, 3, NULL, '업무 프로세스 점검', '127.0.0.1', 'mandatory', '업무 프로세스 점검 149', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 343 MINUTE), 2, 4, NULL, '팀 성과 리뷰', '127.0.0.1', 'announcement', '팀 성과 리뷰 148', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 338 MINUTE), 2, 5, NULL, '시스템 개선 요청', '127.0.0.1', 'error', '시스템 개선 요청 147', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 333 MINUTE), 2, 6, NULL, '부서 KPI 분석', '127.0.0.1', 'inquiry', '부서 KPI 분석 146', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 328 MINUTE), 2, 7, NULL, '정기 검토 보고서', '127.0.0.1', 'general', '정기 검토 보고서 145', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 323 MINUTE), 2, 1, NULL, '팀 성과 분석', '127.0.0.1', 'mandatory', '팀 성과 분석 144', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 318 MINUTE), 2, 2, NULL, '업무 점검', '127.0.0.1', 'announcement', '업무 점검 143', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 313 MINUTE), 2, 3, NULL, '부서 성과 리뷰', '127.0.0.1', 'error', '부서 성과 리뷰 142', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 308 MINUTE), 2, 4, NULL, '정기 검토 계획', '127.0.0.1', 'inquiry', '정기 검토 계획 141', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 303 MINUTE), 2, 5, NULL, '시스템 점검 공지', '127.0.0.1', 'general', '시스템 점검 공지 140', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 298 MINUTE), 2, 6, NULL, '업무 프로세스 개선', '127.0.0.1', 'mandatory', '업무 프로세스 개선 139', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 293 MINUTE), 2, 7, NULL, '팀 성과 리뷰', '127.0.0.1', 'announcement', '팀 성과 리뷰 138', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 288 MINUTE), 2, 1, NULL, '부서 KPI 분석', '127.0.0.1', 'error', '부서 KPI 분석 137', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 283 MINUTE), 2, 2, NULL, '정기 검토 결과', '127.0.0.1', 'inquiry', '정기 검토 결과 136', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 278 MINUTE), 2, 3, NULL, '업무 점검 공지', '127.0.0.1', 'general', '업무 점검 공지 135', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 273 MINUTE), 2, 4, NULL, '시스템 개선 계획', '127.0.0.1', 'mandatory', '시스템 개선 계획 134', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 268 MINUTE), 2, 5, NULL, '부서 성과 리뷰', '127.0.0.1', 'announcement', '부서 성과 리뷰 133', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 263 MINUTE), 2, 6, NULL, '팀 성과 분석', '127.0.0.1', 'error', '팀 성과 분석 132', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 258 MINUTE), 2, 7, NULL, '업무 프로세스 개선', '127.0.0.1', 'inquiry', '업무 프로세스 개선 131', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 253 MINUTE), 2, 1, NULL, '정기 검토 결과', '127.0.0.1', 'general', '정기 검토 결과 130', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 248 MINUTE), 2, 2, NULL, '부서 KPI 분석', '127.0.0.1', 'mandatory', '부서 KPI 분석 129', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 243 MINUTE), 2, 3, NULL, '팀 성과 리뷰', '127.0.0.1', 'announcement', '팀 성과 리뷰 128', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 238 MINUTE), 2, 4, NULL, '업무 점검 공지', '127.0.0.1', 'error', '업무 점검 공지 127', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 233 MINUTE), 2, 5, NULL, '시스템 점검 결과', '127.0.0.1', 'inquiry', '시스템 점검 결과 126', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 228 MINUTE), 2, 6, NULL, '정기 검토 보고서', '127.0.0.1', 'general', '정기 검토 보고서 125', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 223 MINUTE), 2, 7, NULL, '부서 성과 분석', '127.0.0.1', 'mandatory', '부서 성과 분석 124', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 218 MINUTE), 2, 1, NULL, '팀 성과 분석', '127.0.0.1', 'announcement', '팀 성과 분석 123', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 213 MINUTE), 2, 2, NULL, '업무 프로세스 점검', '127.0.0.1', 'error', '업무 프로세스 점검 122', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 208 MINUTE), 2, 3, NULL, '정기 검토 계획', '127.0.0.1', 'inquiry', '정기 검토 계획 121', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 203 MINUTE), 2, 4, NULL, '부서 KPI 분석 결과', '127.0.0.1', 'general', '부서 KPI 분석 결과 120', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 198 MINUTE), 2, 5, NULL, '팀 성과 리뷰', '127.0.0.1', 'mandatory', '팀 성과 리뷰 119', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 193 MINUTE), 2, 6, NULL, '업무 점검 결과', '127.0.0.1', 'announcement', '업무 점검 결과 118', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 188 MINUTE), 2, 7, NULL, '시스템 점검 공지', '127.0.0.1', 'error', '시스템 점검 공지 117', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 183 MINUTE), 2, 1, NULL, '정기 검토 보고서', '127.0.0.1', 'inquiry', '정기 검토 보고서 116', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 178 MINUTE), 2, 2, NULL, '부서 성과 리뷰', '127.0.0.1', 'general', '부서 성과 리뷰 115', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 173 MINUTE), 2, 3, NULL, '업무 프로세스 개선', '127.0.0.1', 'mandatory', '업무 프로세스 개선 114', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 168 MINUTE), 2, 4, NULL, '팀 성과 분석', '127.0.0.1', 'announcement', '팀 성과 분석 113', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 163 MINUTE), 2, 5, NULL, '시스템 개선 계획', '127.0.0.1', 'error', '시스템 개선 계획 112', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 158 MINUTE), 2, 6, NULL, '정기 검토 결과', '127.0.0.1', 'inquiry', '정기 검토 결과 111', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 153 MINUTE), 2, 7, NULL, '부서 KPI 분석', '127.0.0.1', 'general', '부서 KPI 분석 110', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 148 MINUTE), 2, 1, NULL, '팀 성과 분석', '127.0.0.1', 'mandatory', '팀 성과 분석 109', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 143 MINUTE), 2, 2, NULL, '업무 점검', '127.0.0.1', 'announcement', '업무 점검 108', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 138 MINUTE), 2, 3, NULL, '정기 검토 계획', '127.0.0.1', 'error', '정기 검토 계획 107', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 133 MINUTE), 2, 4, NULL, '부서 성과 분석', '127.0.0.1', 'inquiry', '부서 성과 분석 106', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 128 MINUTE), 2, 5, NULL, '업무 프로세스 검토', '127.0.0.1', 'general', '업무 프로세스 검토 105', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 123 MINUTE), 2, 6, NULL, '팀 성과 리뷰', '127.0.0.1', 'mandatory', '팀 성과 리뷰 104', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 118 MINUTE), 2, 7, NULL, '시스템 개선 요청', '127.0.0.1', 'announcement', '시스템 개선 요청 103', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 113 MINUTE), 2, 1, NULL, '정기 검토 결과', '127.0.0.1', 'error', '정기 검토 결과 102', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 108 MINUTE), 2, 2, NULL, '부서 KPI 분석', '127.0.0.1', 'inquiry', '부서 KPI 분석 101', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 103 MINUTE), 2, 3, NULL, '업무 점검 결과', '127.0.0.1', 'general', '업무 점검 결과 100', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 98 MINUTE), 2, 4, NULL, '팀 성과 분석', '127.0.0.1', 'mandatory', '팀 성과 분석 99', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 93 MINUTE), 2, 5, NULL, '정기 검토 계획', '127.0.0.1', 'announcement', '정기 검토 계획 98', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 88 MINUTE), 2, 6, NULL, '시스템 점검 결과', '127.0.0.1', 'error', '시스템 점검 결과 97', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 83 MINUTE), 2, 7, NULL, '업무 개선 계획', '127.0.0.1', 'inquiry', '업무 개선 계획 96', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 78 MINUTE), 2, 1, NULL, '부서 성과 분석', '127.0.0.1', 'general', '부서 성과 분석 95', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 73 MINUTE), 2, 2, NULL, '정기 검토 결과', '127.0.0.1', 'mandatory', '정기 검토 결과 94', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 68 MINUTE), 2, 3, NULL, '팀 성과 리뷰', '127.0.0.1', 'announcement', '팀 성과 리뷰 93', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 63 MINUTE), 2, 4, NULL, '업무 프로세스 점검', '127.0.0.1', 'error', '업무 프로세스 점검 92', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 58 MINUTE), 2, 5, NULL, '시스템 개선 계획', '127.0.0.1', 'inquiry', '시스템 개선 계획 91', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 53 MINUTE), 2, 6, NULL, '정기 검토 보고서', '127.0.0.1', 'general', '정기 검토 보고서 90', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 48 MINUTE), 2, 7, NULL, '부서 KPI 분석', '127.0.0.1', 'mandatory', '부서 KPI 분석 89', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 43 MINUTE), 2, 1, NULL, '팀 성과 분석', '127.0.0.1', 'announcement', '팀 성과 분석 88', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 38 MINUTE), 2, 2, NULL, '업무 점검', '127.0.0.1', 'error', '업무 점검 87', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 33 MINUTE), 2, 3, NULL, '정기 검토 계획', '127.0.0.1', 'inquiry', '정기 검토 계획 86', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 28 MINUTE), 2, 4, NULL, '부서 성과 분석', '127.0.0.1', 'general', '부서 성과 분석 85', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 23 MINUTE), 2, 5, NULL, '팀 성과 리뷰', '127.0.0.1', 'mandatory', '팀 성과 리뷰 84', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 18 MINUTE), 2, 6, NULL, '업무 프로세스 점검', '127.0.0.1', 'announcement', '업무 프로세스 점검 83', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 13 MINUTE), 2, 7, NULL, '정기 검토 결과', '127.0.0.1', 'error', '정기 검토 결과 82', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 8 MINUTE), 2, 1, NULL, '부서 성과 리뷰', '127.0.0.1', 'inquiry', '부서 성과 리뷰 81', 'DEPARTMENT'),
    (DATE_SUB(NOW(), INTERVAL 3 MINUTE), 2, 2, NULL, '팀 성과 분석', '127.0.0.1', 'general', '팀 성과 분석 80', 'DEPARTMENT');